podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                       /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);                 /**< Hard Fault, all classes of Fault                                                 */
extern void MemManage_Handler(void);                 /**< Memory Management, MPU mismatch, including Access Violation and No Match         */
extern void BusFault_Handler(void);                  /**< Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
extern void UsageFault_Handler(void);                /**< Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
extern void SVC_Handler(void);                       /**< System Service Call via SVC instruction                                          */
extern void DebugMon_Handler(void);                  /**< Debug Monitor                                                                    */
extern void PendSV_Handler(void);                    /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);                   /**< System Tick Timer                                                                */
extern void DMA0_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA1_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA2_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA3_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA4_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA5_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA6_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA7_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA8_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA9_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA10_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA11_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA12_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA13_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA14_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA15_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA_Error_IRQHandler(void);              /**< Direct memory access controller                                                  */
extern void MCM_IRQHandler(void);                    /**< Miscellaneous Control Module                                                     */
extern void FTF_Command_IRQHandler(void);            /**< Flash Memory Interface                                                           */
extern void FTF_ReadCollision_IRQHandler(void);      /**< Flash Memory Interface                                                           */
extern void PMC_IRQHandler(void);                    /**< Power Management Controller                                                      */
extern void LLWU_IRQHandler(void);                   /**< Low Leakage Wakeup                                                               */
extern void WDOG_IRQHandler(void);                   /**< External Watchdog Monitor                                                        */
extern void I2C0_IRQHandler(void);                   /**< Inter-Integrated Circuit                                                         */
extern void SPI_IRQHandler(void);                    /**< Serial Peripheral Interface                                                      */
extern void UART0_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART0_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART1_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART1_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void ADC_Error_IRQHandler(void);              /**< Analogue to digital converter                                                    */
extern void ADCA_IRQHandler(void);                   /**< Analogue to digital converter                                                    */
extern void CMP0_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CMP1_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void PIT0_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT1_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT2_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT3_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PDB0_IRQHandler(void);                   /**< Programmable Delay Block                                                         */
extern void XBARA_IRQHandler(void);                  /**< Crossbar Switch                                                                  */
extern void PDB1_IRQHandler(void);                   /**< Programmable Delay Block                                                         */
extern void MCG_IRQHandler(void);                    /**< Multipurpose Clock Generator                                                     */
extern void LPTMR0_IRQHandler(void);                 /**< Low Power Timer                                                                  */
extern void PORTA_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTB_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTC_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTD_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTE_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void ENC_COMPARE_IRQHandler(void);            /**< Quadrature Decoder                                                               */
extern void ENC_HOME_IRQHandler(void);               /**< Quadrature Decoder                                                               */
extern void ENC_WDOG_SAB_IRQHandler(void);           /**< Quadrature Decoder                                                               */
extern void ENC_INDEX_IRQHandler(void);              /**< Quadrature Decoder                                                               */
extern void CMP2_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void ADCB_IRQHandler(void);                   /**< Analogue to digital converter                                                    */
extern void CAN0_Message_IRQHandler(void);           /**< Flex Controller Area Network module                                              */
extern void CAN0_BusOff_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void CAN0_Error_IRQHandler(void);             /**< Flex Controller Area Network module                                              */
extern void CAN0_Tx_IRQHandler(void);                /**< Flex Controller Area Network module                                              */
extern void CAN0_Rx_IRQHandler(void);                /**< Flex Controller Area Network module                                              */
extern void CAN0_WakeUp_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void PWMA_CMP0_IRQHandler(void);              /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_RELOAD0_IRQHandler(void);           /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_CMP1_IRQHandler(void);              /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_RELOAD1_IRQHandler(void);           /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_CMP2_IRQHandler(void);              /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_RELOAD2_IRQHandler(void);           /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_CMP3_IRQHandler(void);              /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_RELOAD3_IRQHandler(void);           /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_CAP_IRQHandler(void);               /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_RERR_IRQHandler(void);              /**< Pulse Width Modulator with nano edge placement                                   */
extern void PWMA_FAULT_IRQHandler(void);             /**< Pulse Width Modulator with nano edge placement                                   */
extern void CMP3_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CAN1_Message_IRQHandler(void);           /**< Flex Controller Area Network module                                              */
extern void CAN1_BusOff_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void CAN1_Error_IRQHandler(void);             /**< Flex Controller Area Network module                                              */
extern void CAN1_Tx_IRQHandler(void);                /**< Flex Controller Area Network module                                              */
extern void CAN1_Rx_IRQHandler(void);                /**< Flex Controller Area Network module                                              */
extern void CAN1_WakeUp_IRQHandler(void);            /**< Flex Controller Area Network module                                              */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM4_REV                 0x0001     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          4          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             1          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm4.h"           /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

