podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
#define ADC_CLIST2_SAMPLE7_SHIFT                 (12U)                                               /*!< ADC0_CLIST2.SAMPLE7 Position            */
#define ADC_CLIST2_SAMPLE7(x)                    (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST2.SAMPLE7 Field               */
/* ------- CLIST3 Bit Fields                        ------ */
#define ADC_CLIST3_SAMPLE8_MASK                  (0xFU)                                              /*!< ADC0_CLIST3.SAMPLE8 Mask                */
#define ADC_CLIST3_SAMPLE8_SHIFT                 (0U)                                                /*!< ADC0_CLIST3.SAMPLE8 Position            */
#define ADC_CLIST3_SAMPLE8(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST3.SAMPLE8 Field               */
#define ADC_CLIST3_SAMPLE9_MASK                  (0xF0U)                                             /*!< ADC0_CLIST3.SAMPLE9 Mask                */
#define ADC_CLIST3_SAMPLE9_SHIFT                 (4U)                                                /*!< ADC0_CLIST3.SAMPLE9 Position            */
#define ADC_CLIST3_SAMPLE9(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST3.SAMPLE9 Field               */
#define ADC_CLIST3_SAMPLE10_MASK                 (0xF00U)                                            /*!< ADC0_CLIST3.SAMPLE10 Mask               */
#define ADC_CLIST3_SAMPLE10_SHIFT                (8U)                                                /*!< ADC0_CLIST3.SAMPLE10 Position           */
#define ADC_CLIST3_SAMPLE10(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST3.SAMPLE10 Field              */
#define ADC_CLIST3_SAMPLE11_MASK                 (0xF000U)                                           /*!< ADC0_CLIST3.SAMPLE11 Mask               */
#define ADC_CLIST3_SAMPLE11_SHIFT                (12U)                                               /*!< ADC0_CLIST3.SAMPLE11 Position           */
#define ADC_CLIST3_SAMPLE11(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST3.SAMPLE11 Field              */
/* ------- CLIST4 Bit Fields                        ------ */
#define ADC_CLIST4_SAMPLE12_MASK                 (0xFU)                                              /*!< ADC0_CLIST4.SAMPLE12 Mask               */
#define ADC_CLIST4_SAMPLE12_SHIFT                (0U)                                                /*!< ADC0_CLIST4.SAMPLE12 Position           */
#define ADC_CLIST4_SAMPLE12(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< ADC0_CLIST4.SAMPLE12 Field              */
#define ADC_CLIST4_SAMPLE13_MASK                 (0xF0U)                                             /*!< ADC0_CLIST4.SAMPLE13 Mask               */
#define ADC_CLIST4_SAMPLE13_SHIFT                (4U)                                                /*!< ADC0_CLIST4.SAMPLE13 Position           */
#define ADC_CLIST4_SAMPLE13(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< ADC0_CLIST4.SAMPLE13 Field              */
#define ADC_CLIST4_SAMPLE14_MASK                 (0xF00U)                                            /*!< ADC0_CLIST4.SAMPLE14 Mask               */
#define ADC_CLIST4_SAMPLE14_SHIFT                (8U)                                                /*!< ADC0_CLIST4.SAMPLE14 Position           */
#define ADC_CLIST4_SAMPLE14(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< ADC0_CLIST4.SAMPLE14 Field              */
#define ADC_CLIST4_SAMPLE15_MASK                 (0xF000U)                                           /*!< ADC0_CLIST4.SAMPLE15 Mask               */
#define ADC_CLIST4_SAMPLE15_SHIFT                (12U)                                               /*!< ADC0_CLIST4.SAMPLE15 Position           */
#define ADC_CLIST4_SAMPLE15(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< ADC0_CLIST4.SAMPLE15 Field              */
/* ------- SDIS Bit Fields                          ------ */
#define ADC_SDIS_DS_MASK                         (0xFFFFU)                                           /*!< ADC0_SDIS.DS Mask                       */
#define ADC_SDIS_DS_SHIFT                        (0U)                                                /*!< ADC0_SDIS.DS Position                   */
#define ADC_SDIS_DS(x)                           (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_SDIS.DS Field                      */
/* ------- STAT Bit Fields                          ------ */
#define ADC_STAT_UNDEFINED_MASK                  (0xFFU)                                             /*!< ADC0_STAT.UNDEFINED Mask                */
#define ADC_STAT_UNDEFINED_SHIFT                 (0U)                                                /*!< ADC0_STAT.UNDEFINED Position            */
#define ADC_STAT_UNDEFINED(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< ADC0_STAT.UNDEFINED Field               */
#define ADC_STAT_HLMTI_MASK                      (0x100U)                                            /*!< ADC0_STAT.HLMTI Mask                    */
#define ADC_STAT_HLMTI_SHIFT                     (8U)                                                /*!< ADC0_STAT.HLMTI Position                */
#define ADC_STAT_HLMTI(x)                        (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< ADC0_STAT.HLMTI Field                   */
#define ADC_STAT_LLMTI_MASK                      (0x200U)                                            /*!< ADC0_STAT.LLMTI Mask                    */
#define ADC_STAT_LLMTI_SHIFT                     (9U)                                                /*!< ADC0_STAT.LLMTI Position                */
#define ADC_STAT_LLMTI(x)                        (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< ADC0_STAT.LLMTI Field                   */
#define ADC_STAT_ZCI_MASK                        (0x400U)                                            /*!< ADC0_STAT.ZCI Mask                      */
#define ADC_STAT_ZCI_SHIFT                       (10U)                                               /*!< ADC0_STAT.ZCI Position                  */
#define ADC_STAT_ZCI(x)                          (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< ADC0_STAT.ZCI Field                     */
#define ADC_STAT_EOSI0_MASK                      (0x800U)                                            /*!< ADC0_STAT.EOSI0 Mask                    */
#define ADC_STAT_EOSI0_SHIFT                     (11U)                                               /*!< ADC0_STAT.EOSI0 Position                */
#define ADC_STAT_EOSI0(x)                        (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< ADC0_STAT.EOSI0 Field                   */
#define ADC_STAT_EOSI1_MASK                      (0x1000U)                                           /*!< ADC0_STAT.EOSI1 Mask                    */
#define ADC_STAT_EOSI1_SHIFT                     (12U)                                               /*!< ADC0_STAT.EOSI1 Position                */
#define ADC_STAT_EOSI1(x)                        (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< ADC0_STAT.EOSI1 Field                   */
#define ADC_STAT_CIP1_MASK                       (0x4000U)                                           /*!< ADC0_STAT.CIP1 Mask                     */
#define ADC_STAT_CIP1_SHIFT                      (14U)                                               /*!< ADC0_STAT.CIP1 Position                 */
#define ADC_STAT_CIP1(x)                         (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ADC0_STAT.CIP1 Field                    */
#define ADC_STAT_CIP0_MASK                       (0x8000U)                                           /*!< ADC0_STAT.CIP0 Mask                     */
#define ADC_STAT_CIP0_SHIFT                      (15U)                                               /*!< ADC0_STAT.CIP0 Position                 */
#define ADC_STAT_CIP0(x)                         (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_STAT.CIP0 Field                    */
/* ------- RDY Bit Fields                           ------ */
#define ADC_RDY_RDY_MASK                         (0xFFFFU)                                           /*!< ADC0_RDY.RDY Mask                       */
#define ADC_RDY_RDY_SHIFT                        (0U)                                                /*!< ADC0_RDY.RDY Position                   */
#define ADC_RDY_RDY(x)                           (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_RDY.RDY Field                      */
/* ------- LOLIMSTAT Bit Fields                     ------ */
#define ADC_LOLIMSTAT_LLS_MASK                   (0xFFFFU)                                           /*!< ADC0_LOLIMSTAT.LLS Mask                 */
#define ADC_LOLIMSTAT_LLS_SHIFT                  (0U)                                                /*!< ADC0_LOLIMSTAT.LLS Position             */
#define ADC_LOLIMSTAT_LLS(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_LOLIMSTAT.LLS Field                */
/* ------- HILIMSTAT Bit Fields                     ------ */
#define ADC_HILIMSTAT_HLS_MASK                   (0xFFFFU)                                           /*!< ADC0_HILIMSTAT.HLS Mask                 */
#define ADC_HILIMSTAT_HLS_SHIFT                  (0U)                                                /*!< ADC0_HILIMSTAT.HLS Position             */
#define ADC_HILIMSTAT_HLS(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_HILIMSTAT.HLS Field                */
/* ------- ZXSTAT Bit Fields                        ------ */
#define ADC_ZXSTAT_ZCS_MASK                      (0xFFFFU)                                           /*!< ADC0_ZXSTAT.ZCS Mask                    */
#define ADC_ZXSTAT_ZCS_SHIFT                     (0U)                                                /*!< ADC0_ZXSTAT.ZCS Position                */
#define ADC_ZXSTAT_ZCS(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< ADC0_ZXSTAT.ZCS Field                   */
/* ------- RSLT Bit Fields                          ------ */
#define ADC_RSLT_RSLT_MASK                       (0x7FF8U)                                           /*!< ADC0_RSLT.RSLT Mask                     */
#define ADC_RSLT_RSLT_SHIFT                      (3U)                                                /*!< ADC0_RSLT.RSLT Position                 */
#define ADC_RSLT_RSLT(x)                         (((uint16_t)(((uint16_t)(x))<<3U))&0x7FF8UL)        /*!< ADC0_RSLT.RSLT Field                    */
#define ADC_RSLT_SEXT_MASK                       (0x8000U)                                           /*!< ADC0_RSLT.SEXT Mask                     */
#define ADC_RSLT_SEXT_SHIFT                      (15U)                                               /*!< ADC0_RSLT.SEXT Position                 */
#define ADC_RSLT_SEXT(x)                         (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_RSLT.SEXT Field                    */
/* ------- LOLIM Bit Fields                         ------ */
#define ADC_LOLIM_LLMT_MASK                      (0x7FF8U)                                           /*!< ADC0_LOLIM.LLMT Mask                    */
#define ADC_LOLIM_LLMT_SHIFT                     (3U)                                                /*!< ADC0_LOLIM.LLMT Position                */
#define ADC_LOLIM_LLMT(x)                        (((uint16_t)(((uint16_t)(x))<<3U))&0x7FF8UL)        /*!< ADC0_LOLIM.LLMT Field                   */
/* ------- HILIM Bit Fields                         ------ */
#define ADC_HILIM_HLMT_MASK                      (0x7FF8U)                                           /*!< ADC0_HILIM.HLMT Mask                    */
#define ADC_HILIM_HLMT_SHIFT                     (3U)                                                /*!< ADC0_HILIM.HLMT Position                */
#define ADC_HILIM_HLMT(x)                        (((uint16_t)(((uint16_t)(x))<<3U))&0x7FF8UL)        /*!< ADC0_HILIM.HLMT Field                   */
/* ------- OFFST Bit Fields                         ------ */
#define ADC_OFFST_OFFSET_MASK                    (0x7FF8U)                                           /*!< ADC0_OFFST.OFFSET Mask                  */
#define ADC_OFFST_OFFSET_SHIFT                   (3U)                                                /*!< ADC0_OFFST.OFFSET Position              */
#define ADC_OFFST_OFFSET(x)                      (((uint16_t)(((uint16_t)(x))<<3U))&0x7FF8UL)        /*!< ADC0_OFFST.OFFSET Field                 */
/* ------- PWR Bit Fields                           ------ */
#define ADC_PWR_PD0_MASK                         (0x1U)                                              /*!< ADC0_PWR.PD0 Mask                       */
#define ADC_PWR_PD0_SHIFT                        (0U)                                                /*!< ADC0_PWR.PD0 Position                   */
#define ADC_PWR_PD0(x)                           (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< ADC0_PWR.PD0 Field                      */
#define ADC_PWR_PD1_MASK                         (0x2U)                                              /*!< ADC0_PWR.PD1 Mask                       */
#define ADC_PWR_PD1_SHIFT                        (1U)                                                /*!< ADC0_PWR.PD1 Position                   */
#define ADC_PWR_PD1(x)                           (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< ADC0_PWR.PD1 Field                      */
#define ADC_PWR_APD_MASK                         (0x8U)                                              /*!< ADC0_PWR.APD Mask                       */
#define ADC_PWR_APD_SHIFT                        (3U)                                                /*!< ADC0_PWR.APD Position                   */
#define ADC_PWR_APD(x)                           (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< ADC0_PWR.APD Field                      */
#define ADC_PWR_PUDELAY_MASK                     (0x3F0U)                                            /*!< ADC0_PWR.PUDELAY Mask                   */
#define ADC_PWR_PUDELAY_SHIFT                    (4U)                                                /*!< ADC0_PWR.PUDELAY Position               */
#define ADC_PWR_PUDELAY(x)                       (((uint16_t)(((uint16_t)(x))<<4U))&0x3F0UL)         /*!< ADC0_PWR.PUDELAY Field                  */
#define ADC_PWR_PSTS0_MASK                       (0x400U)                                            /*!< ADC0_PWR.PSTS0 Mask                     */
#define ADC_PWR_PSTS0_SHIFT                      (10U)                                               /*!< ADC0_PWR.PSTS0 Position                 */
#define ADC_PWR_PSTS0(x)                         (((uint16_t)(((uint16_t)(x))<<10U))&0x400UL)        /*!< ADC0_PWR.PSTS0 Field                    */
#define ADC_PWR_PSTS1_MASK                       (0x800U)                                            /*!< ADC0_PWR.PSTS1 Mask                     */
#define ADC_PWR_PSTS1_SHIFT                      (11U)                                               /*!< ADC0_PWR.PSTS1 Position                 */
#define ADC_PWR_PSTS1(x)                         (((uint16_t)(((uint16_t)(x))<<11U))&0x800UL)        /*!< ADC0_PWR.PSTS1 Field                    */
#define ADC_PWR_ASB_MASK                         (0x8000U)                                           /*!< ADC0_PWR.ASB Mask                       */
#define ADC_PWR_ASB_SHIFT                        (15U)                                               /*!< ADC0_PWR.ASB Position                   */
#define ADC_PWR_ASB(x)                           (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_PWR.ASB Field                      */
/* ------- CAL Bit Fields                           ------ */
#define ADC_CAL_SEL_VREFLO_A_MASK                (0x1000U)                                           /*!< ADC0_CAL.SEL_VREFLO_A Mask              */
#define ADC_CAL_SEL_VREFLO_A_SHIFT               (12U)                                               /*!< ADC0_CAL.SEL_VREFLO_A Position          */
#define ADC_CAL_SEL_VREFLO_A(x)                  (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< ADC0_CAL.SEL_VREFLO_A Field             */
#define ADC_CAL_SEL_VREFH_A_MASK                 (0x2000U)                                           /*!< ADC0_CAL.SEL_VREFH_A Mask               */
#define ADC_CAL_SEL_VREFH_A_SHIFT                (13U)                                               /*!< ADC0_CAL.SEL_VREFH_A Position           */
#define ADC_CAL_SEL_VREFH_A(x)                   (((uint16_t)(((uint16_t)(x))<<13U))&0x2000UL)       /*!< ADC0_CAL.SEL_VREFH_A Field              */
#define ADC_CAL_SEL_VREFLO_B_MASK                (0x4000U)                                           /*!< ADC0_CAL.SEL_VREFLO_B Mask              */
#define ADC_CAL_SEL_VREFLO_B_SHIFT               (14U)                                               /*!< ADC0_CAL.SEL_VREFLO_B Position          */
#define ADC_CAL_SEL_VREFLO_B(x)                  (((uint16_t)(((uint16_t)(x))<<14U))&0x4000UL)       /*!< ADC0_CAL.SEL_VREFLO_B Field             */
#define ADC_CAL_SEL_VREFH_B_MASK                 (0x8000U)                                           /*!< ADC0_CAL.SEL_VREFH_B Mask               */
#define ADC_CAL_SEL_VREFH_B_SHIFT                (15U)                                               /*!< ADC0_CAL.SEL_VREFH_B Position           */
#define ADC_CAL_SEL_VREFH_B(x)                   (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< ADC0_CAL.SEL_VREFH_B Field              */
/* ------- GC1 Bit Fields                           ------ */
#define ADC_GC1_GAIN0_MASK                       (0x3U)                                              /*!< ADC0_GC1.GAIN0 Mask                     */
#define ADC_GC1_GAIN0_SHIFT                      (0U)                                                /*!< ADC0_GC1.GAIN0 Position                 */
#define ADC_GC1_GAIN0(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< ADC0_GC1.GAIN0 Field                    */
#define ADC_GC1_GAIN1_MASK                       (0xCU)                                              /*!< ADC0_GC1.GAIN1 Mask                     */
#define ADC_GC1_GAIN1_SHIFT                      (2U)                                                /*!< ADC0_GC1.GAIN1 Position                 */
#define ADC_GC1_GAIN1(x)                         (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< ADC0_GC1.GAIN1 Field                    */
#define ADC_GC1_GAIN2_MASK                       (0x30U)                                             /*!< ADC0_GC1.GAIN2 Mask                     */
#define ADC_GC1_GAIN2_SHIFT                      (4U)                                                /*!< ADC0_GC1.GAIN2 Position                 */
#define ADC_GC1_GAIN2(x)                         (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< ADC0_GC1.GAIN2 Field                    */
#define ADC_GC1_GAIN3_MASK                       (0xC0U)                                             /*!< ADC0_GC1.GAIN3 Mask                     */
#define ADC_GC1_GAIN3_SHIFT                      (6U)                                                /*!< ADC0_GC1.GAIN3 Position                 */
#define ADC_GC1_GAIN3(x)                         (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< ADC0_GC1.GAIN3 Field                    */
#define ADC_GC1_GAIN4_MASK                       (0x300U)                                            /*!< ADC0_GC1.GAIN4 Mask                     */
#define ADC_GC1_GAIN4_SHIFT                      (8U)                                                /*!< ADC0_GC1.GAIN4 Position                 */
#define ADC_GC1_GAIN4(x)                         (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< ADC0_GC1.GAIN4 Field                    */
#define ADC_GC1_GAIN5_MASK                       (0xC00U)                                            /*!< ADC0_GC1.GAIN5 Mask                     */
#define ADC_GC1_GAIN5_SHIFT                      (10U)                                               /*!< ADC0_GC1.GAIN5 Position                 */
#define ADC_GC1_GAIN5(x)                         (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< ADC0_GC1.GAIN5 Field                    */
#define ADC_GC1_GAIN6_MASK                       (0x3000U)                                           /*!< ADC0_GC1.GAIN6 Mask                     */
#define ADC_GC1_GAIN6_SHIFT                      (12U)                                               /*!< ADC0_GC1.GAIN6 Position                 */
#define ADC_GC1_GAIN6(x)                         (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< ADC0_GC1.GAIN6 Field                    */
#define ADC_GC1_GAIN7_MASK                       (0xC000U)                                           /*!< ADC0_GC1.GAIN7 Mask                     */
#define ADC_GC1_GAIN7_SHIFT                      (14U)                                               /*!< ADC0_GC1.GAIN7 Position                 */
#define ADC_GC1_GAIN7(x)                         (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< ADC0_GC1.GAIN7 Field                    */
/* ------- GC2 Bit Fields                           ------ */
#define ADC_GC2_GAIN8_MASK                       (0x3U)                                              /*!< ADC0_GC2.GAIN8 Mask                     */
#define ADC_GC2_GAIN8_SHIFT                      (0U)                                                /*!< ADC0_GC2.GAIN8 Position                 */
#define ADC_GC2_GAIN8(x)                         (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< ADC0_GC2.GAIN8 Field                    */
#define ADC_GC2_GAIN9_MASK                       (0xCU)                                              /*!< ADC0_GC2.GAIN9 Mask                     */
#define ADC_GC2_GAIN9_SHIFT                      (2U)                                                /*!< ADC0_GC2.GAIN9 Position                 */
#define ADC_GC2_GAIN9(x)                         (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< ADC0_GC2.GAIN9 Field                    */
#define ADC_GC2_GAIN10_MASK                      (0x30U)                                             /*!< ADC0_GC2.GAIN10 Mask                    */
#define ADC_GC2_GAIN10_SHIFT                     (4U)                                                /*!< ADC0_GC2.GAIN10 Position                */
#define ADC_GC2_GAIN10(x)                        (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< ADC0_GC2.GAIN10 Field                   */
#define ADC_GC2_GAIN11_MASK                      (0xC0U)                                             /*!< ADC0_GC2.GAIN11 Mask                    */
#define ADC_GC2_GAIN11_SHIFT                     (6U)                                                /*!< ADC0_GC2.GAIN11 Position                */
#define ADC_GC2_GAIN11(x)                        (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< ADC0_GC2.GAIN11 Field                   */
#define ADC_GC2_GAIN12_MASK                      (0x300U)                                            /*!< ADC0_GC2.GAIN12 Mask                    */
#define ADC_GC2_GAIN12_SHIFT                     (8U)                                                /*!< ADC0_GC2.GAIN12 Position                */
#define ADC_GC2_GAIN12(x)                        (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< ADC0_GC2.GAIN12 Field                   */
#define ADC_GC2_GAIN13_MASK                      (0xC00U)                                            /*!< ADC0_GC2.GAIN13 Mask                    */
#define ADC_GC2_GAIN13_SHIFT                     (10U)                                               /*!< ADC0_GC2.GAIN13 Position                */
