podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
/**
* @addtogroup AOI_Register_Masks_GROUP AOI Register Masks
* @brief Register Masks for AOI
* @{
*/
/* ------- BFCRT010 Bit Fields                      ------ */
#define AOI_BFCRT010_PT1_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT010.PT1_DC Mask                */
#define AOI_BFCRT010_PT1_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT010.PT1_DC Position            */
#define AOI_BFCRT010_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT010.PT1_DC Field               */
#define AOI_BFCRT010_PT1_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT010.PT1_CC Mask                */
#define AOI_BFCRT010_PT1_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT010.PT1_CC Position            */
#define AOI_BFCRT010_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT010.PT1_CC Field               */
#define AOI_BFCRT010_PT1_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT010.PT1_BC Mask                */
#define AOI_BFCRT010_PT1_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT010.PT1_BC Position            */
#define AOI_BFCRT010_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT010.PT1_BC Field               */
#define AOI_BFCRT010_PT1_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT010.PT1_AC Mask                */
#define AOI_BFCRT010_PT1_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT010.PT1_AC Position            */
#define AOI_BFCRT010_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT010.PT1_AC Field               */
#define AOI_BFCRT010_PT0_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT010.PT0_DC Mask                */
#define AOI_BFCRT010_PT0_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT010.PT0_DC Position            */
#define AOI_BFCRT010_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT010.PT0_DC Field               */
#define AOI_BFCRT010_PT0_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT010.PT0_CC Mask                */
#define AOI_BFCRT010_PT0_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT010.PT0_CC Position            */
#define AOI_BFCRT010_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT010.PT0_CC Field               */
#define AOI_BFCRT010_PT0_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT010.PT0_BC Mask                */
#define AOI_BFCRT010_PT0_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT010.PT0_BC Position            */
#define AOI_BFCRT010_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT010.PT0_BC Field               */
#define AOI_BFCRT010_PT0_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT010.PT0_AC Mask                */
#define AOI_BFCRT010_PT0_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT010.PT0_AC Position            */
#define AOI_BFCRT010_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT010.PT0_AC Field               */
/* ------- BFCRT230 Bit Fields                      ------ */
#define AOI_BFCRT230_PT3_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT230.PT3_DC Mask                */
#define AOI_BFCRT230_PT3_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT230.PT3_DC Position            */
#define AOI_BFCRT230_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT230.PT3_DC Field               */
#define AOI_BFCRT230_PT3_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT230.PT3_CC Mask                */
#define AOI_BFCRT230_PT3_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT230.PT3_CC Position            */
#define AOI_BFCRT230_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT230.PT3_CC Field               */
#define AOI_BFCRT230_PT3_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT230.PT3_BC Mask                */
#define AOI_BFCRT230_PT3_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT230.PT3_BC Position            */
#define AOI_BFCRT230_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT230.PT3_BC Field               */
#define AOI_BFCRT230_PT3_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT230.PT3_AC Mask                */
#define AOI_BFCRT230_PT3_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT230.PT3_AC Position            */
#define AOI_BFCRT230_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT230.PT3_AC Field               */
#define AOI_BFCRT230_PT2_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT230.PT2_DC Mask                */
#define AOI_BFCRT230_PT2_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT230.PT2_DC Position            */
#define AOI_BFCRT230_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT230.PT2_DC Field               */
#define AOI_BFCRT230_PT2_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT230.PT2_CC Mask                */
#define AOI_BFCRT230_PT2_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT230.PT2_CC Position            */
#define AOI_BFCRT230_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT230.PT2_CC Field               */
#define AOI_BFCRT230_PT2_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT230.PT2_BC Mask                */
#define AOI_BFCRT230_PT2_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT230.PT2_BC Position            */
#define AOI_BFCRT230_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT230.PT2_BC Field               */
#define AOI_BFCRT230_PT2_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT230.PT2_AC Mask                */
#define AOI_BFCRT230_PT2_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT230.PT2_AC Position            */
#define AOI_BFCRT230_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT230.PT2_AC Field               */
/* ------- BFCRT011 Bit Fields                      ------ */
#define AOI_BFCRT011_PT1_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT011.PT1_DC Mask                */
#define AOI_BFCRT011_PT1_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT011.PT1_DC Position            */
#define AOI_BFCRT011_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT011.PT1_DC Field               */
#define AOI_BFCRT011_PT1_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT011.PT1_CC Mask                */
#define AOI_BFCRT011_PT1_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT011.PT1_CC Position            */
#define AOI_BFCRT011_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT011.PT1_CC Field               */
#define AOI_BFCRT011_PT1_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT011.PT1_BC Mask                */
#define AOI_BFCRT011_PT1_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT011.PT1_BC Position            */
#define AOI_BFCRT011_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT011.PT1_BC Field               */
#define AOI_BFCRT011_PT1_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT011.PT1_AC Mask                */
#define AOI_BFCRT011_PT1_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT011.PT1_AC Position            */
#define AOI_BFCRT011_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT011.PT1_AC Field               */
#define AOI_BFCRT011_PT0_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT011.PT0_DC Mask                */
#define AOI_BFCRT011_PT0_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT011.PT0_DC Position            */
#define AOI_BFCRT011_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT011.PT0_DC Field               */
#define AOI_BFCRT011_PT0_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT011.PT0_CC Mask                */
#define AOI_BFCRT011_PT0_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT011.PT0_CC Position            */
#define AOI_BFCRT011_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT011.PT0_CC Field               */
#define AOI_BFCRT011_PT0_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT011.PT0_BC Mask                */
#define AOI_BFCRT011_PT0_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT011.PT0_BC Position            */
#define AOI_BFCRT011_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT011.PT0_BC Field               */
#define AOI_BFCRT011_PT0_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT011.PT0_AC Mask                */
#define AOI_BFCRT011_PT0_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT011.PT0_AC Position            */
#define AOI_BFCRT011_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT011.PT0_AC Field               */
/* ------- BFCRT231 Bit Fields                      ------ */
#define AOI_BFCRT231_PT3_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT231.PT3_DC Mask                */
#define AOI_BFCRT231_PT3_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT231.PT3_DC Position            */
#define AOI_BFCRT231_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT231.PT3_DC Field               */
#define AOI_BFCRT231_PT3_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT231.PT3_CC Mask                */
#define AOI_BFCRT231_PT3_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT231.PT3_CC Position            */
#define AOI_BFCRT231_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT231.PT3_CC Field               */
#define AOI_BFCRT231_PT3_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT231.PT3_BC Mask                */
#define AOI_BFCRT231_PT3_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT231.PT3_BC Position            */
#define AOI_BFCRT231_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT231.PT3_BC Field               */
#define AOI_BFCRT231_PT3_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT231.PT3_AC Mask                */
#define AOI_BFCRT231_PT3_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT231.PT3_AC Position            */
#define AOI_BFCRT231_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT231.PT3_AC Field               */
#define AOI_BFCRT231_PT2_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT231.PT2_DC Mask                */
#define AOI_BFCRT231_PT2_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT231.PT2_DC Position            */
#define AOI_BFCRT231_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT231.PT2_DC Field               */
#define AOI_BFCRT231_PT2_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT231.PT2_CC Mask                */
#define AOI_BFCRT231_PT2_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT231.PT2_CC Position            */
#define AOI_BFCRT231_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT231.PT2_CC Field               */
#define AOI_BFCRT231_PT2_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT231.PT2_BC Mask                */
#define AOI_BFCRT231_PT2_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT231.PT2_BC Position            */
#define AOI_BFCRT231_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT231.PT2_BC Field               */
#define AOI_BFCRT231_PT2_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT231.PT2_AC Mask                */
#define AOI_BFCRT231_PT2_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT231.PT2_AC Position            */
#define AOI_BFCRT231_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT231.PT2_AC Field               */
/* ------- BFCRT012 Bit Fields                      ------ */
#define AOI_BFCRT012_PT1_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT012.PT1_DC Mask                */
#define AOI_BFCRT012_PT1_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT012.PT1_DC Position            */
#define AOI_BFCRT012_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT012.PT1_DC Field               */
#define AOI_BFCRT012_PT1_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT012.PT1_CC Mask                */
#define AOI_BFCRT012_PT1_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT012.PT1_CC Position            */
#define AOI_BFCRT012_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT012.PT1_CC Field               */
#define AOI_BFCRT012_PT1_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT012.PT1_BC Mask                */
#define AOI_BFCRT012_PT1_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT012.PT1_BC Position            */
#define AOI_BFCRT012_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT012.PT1_BC Field               */
#define AOI_BFCRT012_PT1_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT012.PT1_AC Mask                */
#define AOI_BFCRT012_PT1_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT012.PT1_AC Position            */
#define AOI_BFCRT012_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT012.PT1_AC Field               */
#define AOI_BFCRT012_PT0_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT012.PT0_DC Mask                */
#define AOI_BFCRT012_PT0_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT012.PT0_DC Position            */
#define AOI_BFCRT012_PT0_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT012.PT0_DC Field               */
#define AOI_BFCRT012_PT0_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT012.PT0_CC Mask                */
#define AOI_BFCRT012_PT0_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT012.PT0_CC Position            */
#define AOI_BFCRT012_PT0_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT012.PT0_CC Field               */
#define AOI_BFCRT012_PT0_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT012.PT0_BC Mask                */
#define AOI_BFCRT012_PT0_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT012.PT0_BC Position            */
#define AOI_BFCRT012_PT0_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT012.PT0_BC Field               */
#define AOI_BFCRT012_PT0_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT012.PT0_AC Mask                */
#define AOI_BFCRT012_PT0_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT012.PT0_AC Position            */
#define AOI_BFCRT012_PT0_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT012.PT0_AC Field               */
/* ------- BFCRT232 Bit Fields                      ------ */
#define AOI_BFCRT232_PT3_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT232.PT3_DC Mask                */
#define AOI_BFCRT232_PT3_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT232.PT3_DC Position            */
#define AOI_BFCRT232_PT3_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT232.PT3_DC Field               */
#define AOI_BFCRT232_PT3_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT232.PT3_CC Mask                */
#define AOI_BFCRT232_PT3_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT232.PT3_CC Position            */
#define AOI_BFCRT232_PT3_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT232.PT3_CC Field               */
#define AOI_BFCRT232_PT3_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT232.PT3_BC Mask                */
#define AOI_BFCRT232_PT3_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT232.PT3_BC Position            */
#define AOI_BFCRT232_PT3_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT232.PT3_BC Field               */
#define AOI_BFCRT232_PT3_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT232.PT3_AC Mask                */
#define AOI_BFCRT232_PT3_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT232.PT3_AC Position            */
#define AOI_BFCRT232_PT3_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT232.PT3_AC Field               */
#define AOI_BFCRT232_PT2_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT232.PT2_DC Mask                */
#define AOI_BFCRT232_PT2_DC_SHIFT                (8U)                                                /*!< AOI_BFCRT232.PT2_DC Position            */
#define AOI_BFCRT232_PT2_DC(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< AOI_BFCRT232.PT2_DC Field               */
#define AOI_BFCRT232_PT2_CC_MASK                 (0xC00U)                                            /*!< AOI_BFCRT232.PT2_CC Mask                */
#define AOI_BFCRT232_PT2_CC_SHIFT                (10U)                                               /*!< AOI_BFCRT232.PT2_CC Position            */
#define AOI_BFCRT232_PT2_CC(x)                   (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< AOI_BFCRT232.PT2_CC Field               */
#define AOI_BFCRT232_PT2_BC_MASK                 (0x3000U)                                           /*!< AOI_BFCRT232.PT2_BC Mask                */
#define AOI_BFCRT232_PT2_BC_SHIFT                (12U)                                               /*!< AOI_BFCRT232.PT2_BC Position            */
#define AOI_BFCRT232_PT2_BC(x)                   (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< AOI_BFCRT232.PT2_BC Field               */
#define AOI_BFCRT232_PT2_AC_MASK                 (0xC000U)                                           /*!< AOI_BFCRT232.PT2_AC Mask                */
#define AOI_BFCRT232_PT2_AC_SHIFT                (14U)                                               /*!< AOI_BFCRT232.PT2_AC Position            */
#define AOI_BFCRT232_PT2_AC(x)                   (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< AOI_BFCRT232.PT2_AC Field               */
/* ------- BFCRT013 Bit Fields                      ------ */
#define AOI_BFCRT013_PT1_DC_MASK                 (0x3U)                                              /*!< AOI_BFCRT013.PT1_DC Mask                */
#define AOI_BFCRT013_PT1_DC_SHIFT                (0U)                                                /*!< AOI_BFCRT013.PT1_DC Position            */
#define AOI_BFCRT013_PT1_DC(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< AOI_BFCRT013.PT1_DC Field               */
#define AOI_BFCRT013_PT1_CC_MASK                 (0xCU)                                              /*!< AOI_BFCRT013.PT1_CC Mask                */
#define AOI_BFCRT013_PT1_CC_SHIFT                (2U)                                                /*!< AOI_BFCRT013.PT1_CC Position            */
#define AOI_BFCRT013_PT1_CC(x)                   (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< AOI_BFCRT013.PT1_CC Field               */
#define AOI_BFCRT013_PT1_BC_MASK                 (0x30U)                                             /*!< AOI_BFCRT013.PT1_BC Mask                */
#define AOI_BFCRT013_PT1_BC_SHIFT                (4U)                                                /*!< AOI_BFCRT013.PT1_BC Position            */
#define AOI_BFCRT013_PT1_BC(x)                   (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< AOI_BFCRT013.PT1_BC Field               */
#define AOI_BFCRT013_PT1_AC_MASK                 (0xC0U)                                             /*!< AOI_BFCRT013.PT1_AC Mask                */
#define AOI_BFCRT013_PT1_AC_SHIFT                (6U)                                                /*!< AOI_BFCRT013.PT1_AC Position            */
#define AOI_BFCRT013_PT1_AC(x)                   (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< AOI_BFCRT013.PT1_AC Field               */
#define AOI_BFCRT013_PT0_DC_MASK                 (0x300U)                                            /*!< AOI_BFCRT013.PT0_DC Mask                */
