podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
#define PWMA_SM3CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL4CYC.CVAL4CYC Field         */
/* ------- SM3CVAL5 Bit Fields                      ------ */
#define PWMA_SM3CVAL5_CAPTVAL5_MASK              (0xFFFFU)                                           /*!< PWMA_SM3CVAL5.CAPTVAL5 Mask             */
#define PWMA_SM3CVAL5_CAPTVAL5_SHIFT             (0U)                                                /*!< PWMA_SM3CVAL5.CAPTVAL5 Position         */
#define PWMA_SM3CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0xFFFFUL)        /*!< PWMA_SM3CVAL5.CAPTVAL5 Field            */
/* ------- SM3CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_MASK           (0xFU)                                              /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Mask          */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_SHIFT          (0U)                                                /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Position      */
#define PWMA_SM3CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_SM3CVAL5CYC.CVAL5CYC Field         */
/* ------- OUTEN Bit Fields                         ------ */
#define PWMA_OUTEN_PWMX_EN_MASK                  (0xFU)                                              /*!< PWMA_OUTEN.PWMX_EN Mask                 */
#define PWMA_OUTEN_PWMX_EN_SHIFT                 (0U)                                                /*!< PWMA_OUTEN.PWMX_EN Position             */
#define PWMA_OUTEN_PWMX_EN(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_OUTEN.PWMX_EN Field                */
#define PWMA_OUTEN_PWMB_EN_MASK                  (0xF0U)                                             /*!< PWMA_OUTEN.PWMB_EN Mask                 */
#define PWMA_OUTEN_PWMB_EN_SHIFT                 (4U)                                                /*!< PWMA_OUTEN.PWMB_EN Position             */
#define PWMA_OUTEN_PWMB_EN(x)                    (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_OUTEN.PWMB_EN Field                */
#define PWMA_OUTEN_PWMA_EN_MASK                  (0xF00U)                                            /*!< PWMA_OUTEN.PWMA_EN Mask                 */
#define PWMA_OUTEN_PWMA_EN_SHIFT                 (8U)                                                /*!< PWMA_OUTEN.PWMA_EN Position             */
#define PWMA_OUTEN_PWMA_EN(x)                    (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_OUTEN.PWMA_EN Field                */
/* ------- MASK Bit Fields                          ------ */
#define PWMA_MASK_MASKX_MASK                     (0xFU)                                              /*!< PWMA_MASK.MASKX Mask                    */
#define PWMA_MASK_MASKX_SHIFT                    (0U)                                                /*!< PWMA_MASK.MASKX Position                */
#define PWMA_MASK_MASKX(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_MASK.MASKX Field                   */
#define PWMA_MASK_MASKB_MASK                     (0xF0U)                                             /*!< PWMA_MASK.MASKB Mask                    */
#define PWMA_MASK_MASKB_SHIFT                    (4U)                                                /*!< PWMA_MASK.MASKB Position                */
#define PWMA_MASK_MASKB(x)                       (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_MASK.MASKB Field                   */
#define PWMA_MASK_MASKA_MASK                     (0xF00U)                                            /*!< PWMA_MASK.MASKA Mask                    */
#define PWMA_MASK_MASKA_SHIFT                    (8U)                                                /*!< PWMA_MASK.MASKA Position                */
#define PWMA_MASK_MASKA(x)                       (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_MASK.MASKA Field                   */
#define PWMA_MASK_UPDATE_MASK_MASK               (0xF000U)                                           /*!< PWMA_MASK.UPDATE_MASK Mask              */
#define PWMA_MASK_UPDATE_MASK_SHIFT              (12U)                                               /*!< PWMA_MASK.UPDATE_MASK Position          */
#define PWMA_MASK_UPDATE_MASK(x)                 (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_MASK.UPDATE_MASK Field             */
/* ------- SWCOUT Bit Fields                        ------ */
#define PWMA_SWCOUT_SM0OUT45_MASK                (0x1U)                                              /*!< PWMA_SWCOUT.SM0OUT45 Mask               */
#define PWMA_SWCOUT_SM0OUT45_SHIFT               (0U)                                                /*!< PWMA_SWCOUT.SM0OUT45 Position           */
#define PWMA_SWCOUT_SM0OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_SWCOUT.SM0OUT45 Field              */
#define PWMA_SWCOUT_SM0OUT23_MASK                (0x2U)                                              /*!< PWMA_SWCOUT.SM0OUT23 Mask               */
#define PWMA_SWCOUT_SM0OUT23_SHIFT               (1U)                                                /*!< PWMA_SWCOUT.SM0OUT23 Position           */
#define PWMA_SWCOUT_SM0OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< PWMA_SWCOUT.SM0OUT23 Field              */
#define PWMA_SWCOUT_SM1OUT45_MASK                (0x4U)                                              /*!< PWMA_SWCOUT.SM1OUT45 Mask               */
#define PWMA_SWCOUT_SM1OUT45_SHIFT               (2U)                                                /*!< PWMA_SWCOUT.SM1OUT45 Position           */
#define PWMA_SWCOUT_SM1OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<2U))&0x4UL)           /*!< PWMA_SWCOUT.SM1OUT45 Field              */
#define PWMA_SWCOUT_SM1OUT23_MASK                (0x8U)                                              /*!< PWMA_SWCOUT.SM1OUT23 Mask               */
#define PWMA_SWCOUT_SM1OUT23_SHIFT               (3U)                                                /*!< PWMA_SWCOUT.SM1OUT23 Position           */
#define PWMA_SWCOUT_SM1OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<3U))&0x8UL)           /*!< PWMA_SWCOUT.SM1OUT23 Field              */
#define PWMA_SWCOUT_SM2OUT45_MASK                (0x10U)                                             /*!< PWMA_SWCOUT.SM2OUT45 Mask               */
#define PWMA_SWCOUT_SM2OUT45_SHIFT               (4U)                                                /*!< PWMA_SWCOUT.SM2OUT45 Position           */
#define PWMA_SWCOUT_SM2OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< PWMA_SWCOUT.SM2OUT45 Field              */
#define PWMA_SWCOUT_SM2OUT23_MASK                (0x20U)                                             /*!< PWMA_SWCOUT.SM2OUT23 Mask               */
#define PWMA_SWCOUT_SM2OUT23_SHIFT               (5U)                                                /*!< PWMA_SWCOUT.SM2OUT23 Position           */
#define PWMA_SWCOUT_SM2OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<5U))&0x20UL)          /*!< PWMA_SWCOUT.SM2OUT23 Field              */
#define PWMA_SWCOUT_SM3OUT45_MASK                (0x40U)                                             /*!< PWMA_SWCOUT.SM3OUT45 Mask               */
#define PWMA_SWCOUT_SM3OUT45_SHIFT               (6U)                                                /*!< PWMA_SWCOUT.SM3OUT45 Position           */
#define PWMA_SWCOUT_SM3OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<6U))&0x40UL)          /*!< PWMA_SWCOUT.SM3OUT45 Field              */
#define PWMA_SWCOUT_SM3OUT23_MASK                (0x80U)                                             /*!< PWMA_SWCOUT.SM3OUT23 Mask               */
#define PWMA_SWCOUT_SM3OUT23_SHIFT               (7U)                                                /*!< PWMA_SWCOUT.SM3OUT23 Position           */
#define PWMA_SWCOUT_SM3OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<7U))&0x80UL)          /*!< PWMA_SWCOUT.SM3OUT23 Field              */
/* ------- DTSRCSEL Bit Fields                      ------ */
#define PWMA_DTSRCSEL_SM0SEL45_MASK              (0x3U)                                              /*!< PWMA_DTSRCSEL.SM0SEL45 Mask             */
#define PWMA_DTSRCSEL_SM0SEL45_SHIFT             (0U)                                                /*!< PWMA_DTSRCSEL.SM0SEL45 Position         */
#define PWMA_DTSRCSEL_SM0SEL45(x)                (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_DTSRCSEL.SM0SEL45 Field            */
#define PWMA_DTSRCSEL_SM0SEL23_MASK              (0xCU)                                              /*!< PWMA_DTSRCSEL.SM0SEL23 Mask             */
#define PWMA_DTSRCSEL_SM0SEL23_SHIFT             (2U)                                                /*!< PWMA_DTSRCSEL.SM0SEL23 Position         */
#define PWMA_DTSRCSEL_SM0SEL23(x)                (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< PWMA_DTSRCSEL.SM0SEL23 Field            */
#define PWMA_DTSRCSEL_SM1SEL45_MASK              (0x30U)                                             /*!< PWMA_DTSRCSEL.SM1SEL45 Mask             */
#define PWMA_DTSRCSEL_SM1SEL45_SHIFT             (4U)                                                /*!< PWMA_DTSRCSEL.SM1SEL45 Position         */
#define PWMA_DTSRCSEL_SM1SEL45(x)                (((uint16_t)(((uint16_t)(x))<<4U))&0x30UL)          /*!< PWMA_DTSRCSEL.SM1SEL45 Field            */
#define PWMA_DTSRCSEL_SM1SEL23_MASK              (0xC0U)                                             /*!< PWMA_DTSRCSEL.SM1SEL23 Mask             */
#define PWMA_DTSRCSEL_SM1SEL23_SHIFT             (6U)                                                /*!< PWMA_DTSRCSEL.SM1SEL23 Position         */
#define PWMA_DTSRCSEL_SM1SEL23(x)                (((uint16_t)(((uint16_t)(x))<<6U))&0xC0UL)          /*!< PWMA_DTSRCSEL.SM1SEL23 Field            */
#define PWMA_DTSRCSEL_SM2SEL45_MASK              (0x300U)                                            /*!< PWMA_DTSRCSEL.SM2SEL45 Mask             */
#define PWMA_DTSRCSEL_SM2SEL45_SHIFT             (8U)                                                /*!< PWMA_DTSRCSEL.SM2SEL45 Position         */
#define PWMA_DTSRCSEL_SM2SEL45(x)                (((uint16_t)(((uint16_t)(x))<<8U))&0x300UL)         /*!< PWMA_DTSRCSEL.SM2SEL45 Field            */
#define PWMA_DTSRCSEL_SM2SEL23_MASK              (0xC00U)                                            /*!< PWMA_DTSRCSEL.SM2SEL23 Mask             */
#define PWMA_DTSRCSEL_SM2SEL23_SHIFT             (10U)                                               /*!< PWMA_DTSRCSEL.SM2SEL23 Position         */
#define PWMA_DTSRCSEL_SM2SEL23(x)                (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< PWMA_DTSRCSEL.SM2SEL23 Field            */
#define PWMA_DTSRCSEL_SM3SEL45_MASK              (0x3000U)                                           /*!< PWMA_DTSRCSEL.SM3SEL45 Mask             */
#define PWMA_DTSRCSEL_SM3SEL45_SHIFT             (12U)                                               /*!< PWMA_DTSRCSEL.SM3SEL45 Position         */
#define PWMA_DTSRCSEL_SM3SEL45(x)                (((uint16_t)(((uint16_t)(x))<<12U))&0x3000UL)       /*!< PWMA_DTSRCSEL.SM3SEL45 Field            */
#define PWMA_DTSRCSEL_SM3SEL23_MASK              (0xC000U)                                           /*!< PWMA_DTSRCSEL.SM3SEL23 Mask             */
#define PWMA_DTSRCSEL_SM3SEL23_SHIFT             (14U)                                               /*!< PWMA_DTSRCSEL.SM3SEL23 Position         */
#define PWMA_DTSRCSEL_SM3SEL23(x)                (((uint16_t)(((uint16_t)(x))<<14U))&0xC000UL)       /*!< PWMA_DTSRCSEL.SM3SEL23 Field            */
/* ------- MCTRL Bit Fields                         ------ */
#define PWMA_MCTRL_LDOK_MASK                     (0xFU)                                              /*!< PWMA_MCTRL.LDOK Mask                    */
#define PWMA_MCTRL_LDOK_SHIFT                    (0U)                                                /*!< PWMA_MCTRL.LDOK Position                */
#define PWMA_MCTRL_LDOK(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_MCTRL.LDOK Field                   */
#define PWMA_MCTRL_CLDOK_MASK                    (0xF0U)                                             /*!< PWMA_MCTRL.CLDOK Mask                   */
#define PWMA_MCTRL_CLDOK_SHIFT                   (4U)                                                /*!< PWMA_MCTRL.CLDOK Position               */
#define PWMA_MCTRL_CLDOK(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_MCTRL.CLDOK Field                  */
#define PWMA_MCTRL_RUN_MASK                      (0xF00U)                                            /*!< PWMA_MCTRL.RUN Mask                     */
#define PWMA_MCTRL_RUN_SHIFT                     (8U)                                                /*!< PWMA_MCTRL.RUN Position                 */
#define PWMA_MCTRL_RUN(x)                        (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_MCTRL.RUN Field                    */
#define PWMA_MCTRL_IPOL_MASK                     (0xF000U)                                           /*!< PWMA_MCTRL.IPOL Mask                    */
#define PWMA_MCTRL_IPOL_SHIFT                    (12U)                                               /*!< PWMA_MCTRL.IPOL Position                */
#define PWMA_MCTRL_IPOL(x)                       (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_MCTRL.IPOL Field                   */
/* ------- MCTRL2 Bit Fields                        ------ */
#define PWMA_MCTRL2_MONPLL_MASK                  (0x3U)                                              /*!< PWMA_MCTRL2.MONPLL Mask                 */
#define PWMA_MCTRL2_MONPLL_SHIFT                 (0U)                                                /*!< PWMA_MCTRL2.MONPLL Position             */
#define PWMA_MCTRL2_MONPLL(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0x3UL)           /*!< PWMA_MCTRL2.MONPLL Field                */
/* ------- FCTRL Bit Fields                         ------ */
#define PWMA_FCTRL_FIE_MASK                      (0xFU)                                              /*!< PWMA_FCTRL.FIE Mask                     */
#define PWMA_FCTRL_FIE_SHIFT                     (0U)                                                /*!< PWMA_FCTRL.FIE Position                 */
#define PWMA_FCTRL_FIE(x)                        (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_FCTRL.FIE Field                    */
#define PWMA_FCTRL_FSAFE_MASK                    (0xF0U)                                             /*!< PWMA_FCTRL.FSAFE Mask                   */
#define PWMA_FCTRL_FSAFE_SHIFT                   (4U)                                                /*!< PWMA_FCTRL.FSAFE Position               */
#define PWMA_FCTRL_FSAFE(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_FCTRL.FSAFE Field                  */
#define PWMA_FCTRL_FAUTO_MASK                    (0xF00U)                                            /*!< PWMA_FCTRL.FAUTO Mask                   */
#define PWMA_FCTRL_FAUTO_SHIFT                   (8U)                                                /*!< PWMA_FCTRL.FAUTO Position               */
#define PWMA_FCTRL_FAUTO(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_FCTRL.FAUTO Field                  */
#define PWMA_FCTRL_FLVL_MASK                     (0xF000U)                                           /*!< PWMA_FCTRL.FLVL Mask                    */
#define PWMA_FCTRL_FLVL_SHIFT                    (12U)                                               /*!< PWMA_FCTRL.FLVL Position                */
#define PWMA_FCTRL_FLVL(x)                       (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_FCTRL.FLVL Field                   */
/* ------- FSTS Bit Fields                          ------ */
#define PWMA_FSTS_FFLAG_MASK                     (0xFU)                                              /*!< PWMA_FSTS.FFLAG Mask                    */
#define PWMA_FSTS_FFLAG_SHIFT                    (0U)                                                /*!< PWMA_FSTS.FFLAG Position                */
#define PWMA_FSTS_FFLAG(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_FSTS.FFLAG Field                   */
#define PWMA_FSTS_FFULL_MASK                     (0xF0U)                                             /*!< PWMA_FSTS.FFULL Mask                    */
#define PWMA_FSTS_FFULL_SHIFT                    (4U)                                                /*!< PWMA_FSTS.FFULL Position                */
#define PWMA_FSTS_FFULL(x)                       (((uint16_t)(((uint16_t)(x))<<4U))&0xF0UL)          /*!< PWMA_FSTS.FFULL Field                   */
#define PWMA_FSTS_FFPIN_MASK                     (0xF00U)                                            /*!< PWMA_FSTS.FFPIN Mask                    */
#define PWMA_FSTS_FFPIN_SHIFT                    (8U)                                                /*!< PWMA_FSTS.FFPIN Position                */
#define PWMA_FSTS_FFPIN(x)                       (((uint16_t)(((uint16_t)(x))<<8U))&0xF00UL)         /*!< PWMA_FSTS.FFPIN Field                   */
#define PWMA_FSTS_FHALF_MASK                     (0xF000U)                                           /*!< PWMA_FSTS.FHALF Mask                    */
#define PWMA_FSTS_FHALF_SHIFT                    (12U)                                               /*!< PWMA_FSTS.FHALF Position                */
#define PWMA_FSTS_FHALF(x)                       (((uint16_t)(((uint16_t)(x))<<12U))&0xF000UL)       /*!< PWMA_FSTS.FHALF Field                   */
/* ------- FFILT Bit Fields                         ------ */
#define PWMA_FFILT_FILT_PER_MASK                 (0xFFU)                                             /*!< PWMA_FFILT.FILT_PER Mask                */
#define PWMA_FFILT_FILT_PER_SHIFT                (0U)                                                /*!< PWMA_FFILT.FILT_PER Position            */
#define PWMA_FFILT_FILT_PER(x)                   (((uint16_t)(((uint16_t)(x))<<0U))&0xFFUL)          /*!< PWMA_FFILT.FILT_PER Field               */
#define PWMA_FFILT_FILT_CNT_MASK                 (0x700U)                                            /*!< PWMA_FFILT.FILT_CNT Mask                */
#define PWMA_FFILT_FILT_CNT_SHIFT                (8U)                                                /*!< PWMA_FFILT.FILT_CNT Position            */
#define PWMA_FFILT_FILT_CNT(x)                   (((uint16_t)(((uint16_t)(x))<<8U))&0x700UL)         /*!< PWMA_FFILT.FILT_CNT Field               */
#define PWMA_FFILT_GSTR_MASK                     (0x8000U)                                           /*!< PWMA_FFILT.GSTR Mask                    */
#define PWMA_FFILT_GSTR_SHIFT                    (15U)                                               /*!< PWMA_FFILT.GSTR Position                */
#define PWMA_FFILT_GSTR(x)                       (((uint16_t)(((uint16_t)(x))<<15U))&0x8000UL)       /*!< PWMA_FFILT.GSTR Field                   */
/* ------- FTST Bit Fields                          ------ */
#define PWMA_FTST_FTEST_MASK                     (0x1U)                                              /*!< PWMA_FTST.FTEST Mask                    */
#define PWMA_FTST_FTEST_SHIFT                    (0U)                                                /*!< PWMA_FTST.FTEST Position                */
#define PWMA_FTST_FTEST(x)                       (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< PWMA_FTST.FTEST Field                   */
/* ------- FCTRL2 Bit Fields                        ------ */
#define PWMA_FCTRL2_NOCOMB_MASK                  (0xFU)                                              /*!< PWMA_FCTRL2.NOCOMB Mask                 */
#define PWMA_FCTRL2_NOCOMB_SHIFT                 (0U)                                                /*!< PWMA_FCTRL2.NOCOMB Position             */
#define PWMA_FCTRL2_NOCOMB(x)                    (((uint16_t)(((uint16_t)(x))<<0U))&0xFUL)           /*!< PWMA_FCTRL2.NOCOMB Field                */
/**
 * @} */ /* End group PWMA_Register_Masks_GROUP 
 */

/* PWMA - Peripheral instance base addresses */
#define PWMA_BasePtr                   0x40033000UL //!< Peripheral base address
#define PWMA                           ((PWMA_Type *) PWMA_BasePtr) //!< Freescale base pointer
#define PWMA_BASE_PTR                  (PWMA) //!< Freescale style base pointer
/**
 * @} */ /* End group PWMA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup RCM_Peripheral_access_layer_GROUP RCM Peripheral Access Layer
* @brief C Struct for RCM
* @{
*/

/* ================================================================================ */
/* ================           RCM (file:RCM_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief Reset Control Module
 */
/**
* @addtogroup RCM_structs_GROUP RCM struct
* @brief Struct for RCM
* @{
*/
typedef struct RCM_Type {
   __I  uint8_t   SRS0;                         /**< 0000: System Reset Status Register 0                               */
   __I  uint8_t   SRS1;                         /**< 0001: System Reset Status Register 1                               */
        uint8_t   RESERVED_0[2];               
   __IO uint8_t   RPFC;                         /**< 0004: Reset Pin Filter Control Register                            */
   __IO uint8_t   RPFW;                         /**< 0005: Reset Pin Filter Width Register                              */
        uint8_t   RESERVED_1[2];               
   __IO uint8_t   SSRS0;                        /**< 0008: Sticky System Reset Status Register 0                        */
   __IO uint8_t   SSRS1;                        /**< 0009: Sticky System Reset Status Register 1                        */
} RCM_Type;

/**
 * @} */ /* End group RCM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'RCM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

