podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
#define SIM_SOPT8_FTM3OCH2SRC_MASK               (0x4000000U)                                        /*!< SIM_SOPT8.FTM3OCH2SRC Mask              */
#define SIM_SOPT8_FTM3OCH2SRC_SHIFT              (26U)                                               /*!< SIM_SOPT8.FTM3OCH2SRC Position          */
#define SIM_SOPT8_FTM3OCH2SRC(x)                 (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SIM_SOPT8.FTM3OCH2SRC Field             */
#define SIM_SOPT8_FTM3OCH3SRC_MASK               (0x8000000U)                                        /*!< SIM_SOPT8.FTM3OCH3SRC Mask              */
#define SIM_SOPT8_FTM3OCH3SRC_SHIFT              (27U)                                               /*!< SIM_SOPT8.FTM3OCH3SRC Position          */
#define SIM_SOPT8_FTM3OCH3SRC(x)                 (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SIM_SOPT8.FTM3OCH3SRC Field             */
#define SIM_SOPT8_FTM3OCH4SRC_MASK               (0x10000000U)                                       /*!< SIM_SOPT8.FTM3OCH4SRC Mask              */
#define SIM_SOPT8_FTM3OCH4SRC_SHIFT              (28U)                                               /*!< SIM_SOPT8.FTM3OCH4SRC Position          */
#define SIM_SOPT8_FTM3OCH4SRC(x)                 (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SOPT8.FTM3OCH4SRC Field             */
#define SIM_SOPT8_FTM3OCH5SRC_MASK               (0x20000000U)                                       /*!< SIM_SOPT8.FTM3OCH5SRC Mask              */
#define SIM_SOPT8_FTM3OCH5SRC_SHIFT              (29U)                                               /*!< SIM_SOPT8.FTM3OCH5SRC Position          */
#define SIM_SOPT8_FTM3OCH5SRC(x)                 (((uint32_t)(((uint32_t)(x))<<29U))&0x20000000UL)   /*!< SIM_SOPT8.FTM3OCH5SRC Field             */
#define SIM_SOPT8_FTM3OCH6SRC_MASK               (0x40000000U)                                       /*!< SIM_SOPT8.FTM3OCH6SRC Mask              */
#define SIM_SOPT8_FTM3OCH6SRC_SHIFT              (30U)                                               /*!< SIM_SOPT8.FTM3OCH6SRC Position          */
#define SIM_SOPT8_FTM3OCH6SRC(x)                 (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< SIM_SOPT8.FTM3OCH6SRC Field             */
#define SIM_SOPT8_FTM3OCH7SRC_MASK               (0x80000000U)                                       /*!< SIM_SOPT8.FTM3OCH7SRC Mask              */
#define SIM_SOPT8_FTM3OCH7SRC_SHIFT              (31U)                                               /*!< SIM_SOPT8.FTM3OCH7SRC Position          */
#define SIM_SOPT8_FTM3OCH7SRC(x)                 (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< SIM_SOPT8.FTM3OCH7SRC Field             */
/* ------- SOPT9 Bit Fields                         ------ */
#define SIM_SOPT9_FTM1ICH0SRC_MASK               (0x30U)                                             /*!< SIM_SOPT9.FTM1ICH0SRC Mask              */
#define SIM_SOPT9_FTM1ICH0SRC_SHIFT              (4U)                                                /*!< SIM_SOPT9.FTM1ICH0SRC Position          */
#define SIM_SOPT9_FTM1ICH0SRC(x)                 (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< SIM_SOPT9.FTM1ICH0SRC Field             */
#define SIM_SOPT9_FTM1ICH1SRC_MASK               (0x40U)                                             /*!< SIM_SOPT9.FTM1ICH1SRC Mask              */
#define SIM_SOPT9_FTM1ICH1SRC_SHIFT              (6U)                                                /*!< SIM_SOPT9.FTM1ICH1SRC Position          */
#define SIM_SOPT9_FTM1ICH1SRC(x)                 (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SOPT9.FTM1ICH1SRC Field             */
#define SIM_SOPT9_FTM0CLKSEL_MASK                (0x3000000U)                                        /*!< SIM_SOPT9.FTM0CLKSEL Mask               */
#define SIM_SOPT9_FTM0CLKSEL_SHIFT               (24U)                                               /*!< SIM_SOPT9.FTM0CLKSEL Position           */
#define SIM_SOPT9_FTM0CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<24U))&0x3000000UL)    /*!< SIM_SOPT9.FTM0CLKSEL Field              */
#define SIM_SOPT9_FTM1CLKSEL_MASK                (0xC000000U)                                        /*!< SIM_SOPT9.FTM1CLKSEL Mask               */
#define SIM_SOPT9_FTM1CLKSEL_SHIFT               (26U)                                               /*!< SIM_SOPT9.FTM1CLKSEL Position           */
#define SIM_SOPT9_FTM1CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<26U))&0xC000000UL)    /*!< SIM_SOPT9.FTM1CLKSEL Field              */
#define SIM_SOPT9_FTM3CLKSEL_MASK                (0xC0000000U)                                       /*!< SIM_SOPT9.FTM3CLKSEL Mask               */
#define SIM_SOPT9_FTM3CLKSEL_SHIFT               (30U)                                               /*!< SIM_SOPT9.FTM3CLKSEL Position           */
#define SIM_SOPT9_FTM3CLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<30U))&0xC0000000UL)   /*!< SIM_SOPT9.FTM3CLKSEL Field              */
/* ------- SDID Bit Fields                          ------ */
#define SIM_SDID_PINID_MASK                      (0xFU)                                              /*!< SIM_SDID.PINID Mask                     */
#define SIM_SDID_PINID_SHIFT                     (0U)                                                /*!< SIM_SDID.PINID Position                 */
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< SIM_SDID.PINID Field                    */
#define SIM_SDID_DIEID_MASK                      (0xF80U)                                            /*!< SIM_SDID.DIEID Mask                     */
#define SIM_SDID_DIEID_SHIFT                     (7U)                                                /*!< SIM_SDID.DIEID Position                 */
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x))<<7U))&0xF80UL)         /*!< SIM_SDID.DIEID Field                    */
#define SIM_SDID_REVID_MASK                      (0xF000U)                                           /*!< SIM_SDID.REVID Mask                     */
#define SIM_SDID_REVID_SHIFT                     (12U)                                               /*!< SIM_SDID.REVID Position                 */
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< SIM_SDID.REVID Field                    */
#define SIM_SDID_SERIESID_MASK                   (0xF00000U)                                         /*!< SIM_SDID.SERIESID Mask                  */
#define SIM_SDID_SERIESID_SHIFT                  (20U)                                               /*!< SIM_SDID.SERIESID Position              */
#define SIM_SDID_SERIESID(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< SIM_SDID.SERIESID Field                 */
#define SIM_SDID_SUBFAMID_MASK                   (0xF000000U)                                        /*!< SIM_SDID.SUBFAMID Mask                  */
#define SIM_SDID_SUBFAMID_SHIFT                  (24U)                                               /*!< SIM_SDID.SUBFAMID Position              */
#define SIM_SDID_SUBFAMID(x)                     (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_SDID.SUBFAMID Field                 */
#define SIM_SDID_FAMILYID_MASK                   (0xF0000000U)                                       /*!< SIM_SDID.FAMILYID Mask                  */
#define SIM_SDID_FAMILYID_SHIFT                  (28U)                                               /*!< SIM_SDID.FAMILYID Position              */
#define SIM_SDID_FAMILYID(x)                     (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< SIM_SDID.FAMILYID Field                 */
/* ------- SCGC4 Bit Fields                         ------ */
#define SIM_SCGC4_EWM_MASK                       (0x2U)                                              /*!< SIM_SCGC4.EWM Mask                      */
#define SIM_SCGC4_EWM_SHIFT                      (1U)                                                /*!< SIM_SCGC4.EWM Position                  */
#define SIM_SCGC4_EWM(x)                         (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC4.EWM Field                     */
#define SIM_SCGC4_I2C0_MASK                      (0x40U)                                             /*!< SIM_SCGC4.I2C0 Mask                     */
#define SIM_SCGC4_I2C0_SHIFT                     (6U)                                                /*!< SIM_SCGC4.I2C0 Position                 */
#define SIM_SCGC4_I2C0(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SCGC4.I2C0 Field                    */
#define SIM_SCGC4_UART0_MASK                     (0x400U)                                            /*!< SIM_SCGC4.UART0 Mask                    */
#define SIM_SCGC4_UART0_SHIFT                    (10U)                                               /*!< SIM_SCGC4.UART0 Position                */
#define SIM_SCGC4_UART0(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC4.UART0 Field                   */
#define SIM_SCGC4_UART1_MASK                     (0x800U)                                            /*!< SIM_SCGC4.UART1 Mask                    */
#define SIM_SCGC4_UART1_SHIFT                    (11U)                                               /*!< SIM_SCGC4.UART1 Position                */
#define SIM_SCGC4_UART1(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SCGC4.UART1 Field                   */
#define SIM_SCGC4_CMP_MASK                       (0x80000U)                                          /*!< SIM_SCGC4.CMP Mask                      */
#define SIM_SCGC4_CMP_SHIFT                      (19U)                                               /*!< SIM_SCGC4.CMP Position                  */
#define SIM_SCGC4_CMP(x)                         (((uint32_t)(((uint32_t)(x))<<19U))&0x80000UL)      /*!< SIM_SCGC4.CMP Field                     */
#define SIM_SCGC4_eFlexPWM0_MASK                 (0x1000000U)                                        /*!< SIM_SCGC4.eFlexPWM0 Mask                */
#define SIM_SCGC4_eFlexPWM0_SHIFT                (24U)                                               /*!< SIM_SCGC4.eFlexPWM0 Position            */
#define SIM_SCGC4_eFlexPWM0(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SIM_SCGC4.eFlexPWM0 Field               */
#define SIM_SCGC4_eFlexPWM1_MASK                 (0x2000000U)                                        /*!< SIM_SCGC4.eFlexPWM1 Mask                */
#define SIM_SCGC4_eFlexPWM1_SHIFT                (25U)                                               /*!< SIM_SCGC4.eFlexPWM1 Position            */
#define SIM_SCGC4_eFlexPWM1(x)                   (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_SCGC4.eFlexPWM1 Field               */
#define SIM_SCGC4_eFlexPWM2_MASK                 (0x4000000U)                                        /*!< SIM_SCGC4.eFlexPWM2 Mask                */
#define SIM_SCGC4_eFlexPWM2_SHIFT                (26U)                                               /*!< SIM_SCGC4.eFlexPWM2 Position            */
#define SIM_SCGC4_eFlexPWM2(x)                   (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SIM_SCGC4.eFlexPWM2 Field               */
#define SIM_SCGC4_eFlexPWM3_MASK                 (0x8000000U)                                        /*!< SIM_SCGC4.eFlexPWM3 Mask                */
#define SIM_SCGC4_eFlexPWM3_SHIFT                (27U)                                               /*!< SIM_SCGC4.eFlexPWM3 Position            */
#define SIM_SCGC4_eFlexPWM3(x)                   (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SIM_SCGC4.eFlexPWM3 Field               */
/* ------- SCGC5 Bit Fields                         ------ */
#define SIM_SCGC5_LPTMR_MASK                     (0x1U)                                              /*!< SIM_SCGC5.LPTMR Mask                    */
#define SIM_SCGC5_LPTMR_SHIFT                    (0U)                                                /*!< SIM_SCGC5.LPTMR Position                */
#define SIM_SCGC5_LPTMR(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC5.LPTMR Field                   */
#define SIM_SCGC5_PORTA_MASK                     (0x200U)                                            /*!< SIM_SCGC5.PORTA Mask                    */
#define SIM_SCGC5_PORTA_SHIFT                    (9U)                                                /*!< SIM_SCGC5.PORTA Position                */
#define SIM_SCGC5_PORTA(x)                       (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_SCGC5.PORTA Field                   */
#define SIM_SCGC5_PORTB_MASK                     (0x400U)                                            /*!< SIM_SCGC5.PORTB Mask                    */
#define SIM_SCGC5_PORTB_SHIFT                    (10U)                                               /*!< SIM_SCGC5.PORTB Position                */
#define SIM_SCGC5_PORTB(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_SCGC5.PORTB Field                   */
#define SIM_SCGC5_PORTC_MASK                     (0x800U)                                            /*!< SIM_SCGC5.PORTC Mask                    */
#define SIM_SCGC5_PORTC_SHIFT                    (11U)                                               /*!< SIM_SCGC5.PORTC Position                */
#define SIM_SCGC5_PORTC(x)                       (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_SCGC5.PORTC Field                   */
#define SIM_SCGC5_PORTD_MASK                     (0x1000U)                                           /*!< SIM_SCGC5.PORTD Mask                    */
#define SIM_SCGC5_PORTD_SHIFT                    (12U)                                               /*!< SIM_SCGC5.PORTD Position                */
#define SIM_SCGC5_PORTD(x)                       (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC5.PORTD Field                   */
#define SIM_SCGC5_PORTE_MASK                     (0x2000U)                                           /*!< SIM_SCGC5.PORTE Mask                    */
#define SIM_SCGC5_PORTE_SHIFT                    (13U)                                               /*!< SIM_SCGC5.PORTE Position                */
#define SIM_SCGC5_PORTE(x)                       (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_SCGC5.PORTE Field                   */
#define SIM_SCGC5_ENC_MASK                       (0x200000U)                                         /*!< SIM_SCGC5.ENC Mask                      */
#define SIM_SCGC5_ENC_SHIFT                      (21U)                                               /*!< SIM_SCGC5.ENC Position                  */
#define SIM_SCGC5_ENC(x)                         (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SIM_SCGC5.ENC Field                     */
#define SIM_SCGC5_XBARA_MASK                     (0x2000000U)                                        /*!< SIM_SCGC5.XBARA Mask                    */
#define SIM_SCGC5_XBARA_SHIFT                    (25U)                                               /*!< SIM_SCGC5.XBARA Position                */
#define SIM_SCGC5_XBARA(x)                       (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_SCGC5.XBARA Field                   */
#define SIM_SCGC5_XBARB_MASK                     (0x4000000U)                                        /*!< SIM_SCGC5.XBARB Mask                    */
#define SIM_SCGC5_XBARB_SHIFT                    (26U)                                               /*!< SIM_SCGC5.XBARB Position                */
#define SIM_SCGC5_XBARB(x)                       (((uint32_t)(((uint32_t)(x))<<26U))&0x4000000UL)    /*!< SIM_SCGC5.XBARB Field                   */
#define SIM_SCGC5_AOI_MASK                       (0x8000000U)                                        /*!< SIM_SCGC5.AOI Mask                      */
#define SIM_SCGC5_AOI_SHIFT                      (27U)                                               /*!< SIM_SCGC5.AOI Position                  */
#define SIM_SCGC5_AOI(x)                         (((uint32_t)(((uint32_t)(x))<<27U))&0x8000000UL)    /*!< SIM_SCGC5.AOI Field                     */
#define SIM_SCGC5_ADC_MASK                       (0x10000000U)                                       /*!< SIM_SCGC5.ADC Mask                      */
#define SIM_SCGC5_ADC_SHIFT                      (28U)                                               /*!< SIM_SCGC5.ADC Position                  */
#define SIM_SCGC5_ADC(x)                         (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_SCGC5.ADC Field                     */
/* ------- SCGC6 Bit Fields                         ------ */
#define SIM_SCGC6_FTF_MASK                       (0x1U)                                              /*!< SIM_SCGC6.FTF Mask                      */
#define SIM_SCGC6_FTF_SHIFT                      (0U)                                                /*!< SIM_SCGC6.FTF Position                  */
#define SIM_SCGC6_FTF(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_SCGC6.FTF Field                     */
#define SIM_SCGC6_DMAMUX0_MASK                   (0x2U)                                              /*!< SIM_SCGC6.DMAMUX0 Mask                  */
#define SIM_SCGC6_DMAMUX0_SHIFT                  (1U)                                                /*!< SIM_SCGC6.DMAMUX0 Position              */
#define SIM_SCGC6_DMAMUX0(x)                     (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_SCGC6.DMAMUX0 Field                 */
#define SIM_SCGC6_FLEXCAN0_MASK                  (0x10U)                                             /*!< SIM_SCGC6.FLEXCAN0 Mask                 */
#define SIM_SCGC6_FLEXCAN0_SHIFT                 (4U)                                                /*!< SIM_SCGC6.FLEXCAN0 Position             */
#define SIM_SCGC6_FLEXCAN0(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< SIM_SCGC6.FLEXCAN0 Field                */
#define SIM_SCGC6_FLEXCAN1_MASK                  (0x20U)                                             /*!< SIM_SCGC6.FLEXCAN1 Mask                 */
#define SIM_SCGC6_FLEXCAN1_SHIFT                 (5U)                                                /*!< SIM_SCGC6.FLEXCAN1 Position             */
#define SIM_SCGC6_FLEXCAN1(x)                    (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< SIM_SCGC6.FLEXCAN1 Field                */
#define SIM_SCGC6_FTM3_MASK                      (0x40U)                                             /*!< SIM_SCGC6.FTM3 Mask                     */
#define SIM_SCGC6_FTM3_SHIFT                     (6U)                                                /*!< SIM_SCGC6.FTM3 Position                 */
#define SIM_SCGC6_FTM3(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< SIM_SCGC6.FTM3 Field                    */
#define SIM_SCGC6_SPI0_MASK                      (0x1000U)                                           /*!< SIM_SCGC6.SPI0 Mask                     */
#define SIM_SCGC6_SPI0_SHIFT                     (12U)                                               /*!< SIM_SCGC6.SPI0 Position                 */
#define SIM_SCGC6_SPI0(x)                        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_SCGC6.SPI0 Field                    */
#define SIM_SCGC6_PDB1_MASK                      (0x20000U)                                          /*!< SIM_SCGC6.PDB1 Mask                     */
#define SIM_SCGC6_PDB1_SHIFT                     (17U)                                               /*!< SIM_SCGC6.PDB1 Position                 */
#define SIM_SCGC6_PDB1(x)                        (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SIM_SCGC6.PDB1 Field                    */
#define SIM_SCGC6_CRC_MASK                       (0x40000U)                                          /*!< SIM_SCGC6.CRC Mask                      */
#define SIM_SCGC6_CRC_SHIFT                      (18U)                                               /*!< SIM_SCGC6.CRC Position                  */
#define SIM_SCGC6_CRC(x)                         (((uint32_t)(((uint32_t)(x))<<18U))&0x40000UL)      /*!< SIM_SCGC6.CRC Field                     */
#define SIM_SCGC6_PDB0_MASK                      (0x400000U)                                         /*!< SIM_SCGC6.PDB0 Mask                     */
#define SIM_SCGC6_PDB0_SHIFT                     (22U)                                               /*!< SIM_SCGC6.PDB0 Position                 */
#define SIM_SCGC6_PDB0(x)                        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SIM_SCGC6.PDB0 Field                    */
#define SIM_SCGC6_PIT_MASK                       (0x800000U)                                         /*!< SIM_SCGC6.PIT Mask                      */
#define SIM_SCGC6_PIT_SHIFT                      (23U)                                               /*!< SIM_SCGC6.PIT Position                  */
#define SIM_SCGC6_PIT(x)                         (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SIM_SCGC6.PIT Field                     */
#define SIM_SCGC6_FTM0_MASK                      (0x1000000U)                                        /*!< SIM_SCGC6.FTM0 Mask                     */
#define SIM_SCGC6_FTM0_SHIFT                     (24U)                                               /*!< SIM_SCGC6.FTM0 Position                 */
#define SIM_SCGC6_FTM0(x)                        (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SIM_SCGC6.FTM0 Field                    */
#define SIM_SCGC6_FTM1_MASK                      (0x2000000U)                                        /*!< SIM_SCGC6.FTM1 Mask                     */
#define SIM_SCGC6_FTM1_SHIFT                     (25U)                                               /*!< SIM_SCGC6.FTM1 Position                 */
#define SIM_SCGC6_FTM1(x)                        (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_SCGC6.FTM1 Field                    */
#define SIM_SCGC6_DAC0_MASK                      (0x80000000U)                                       /*!< SIM_SCGC6.DAC0 Mask                     */
#define SIM_SCGC6_DAC0_SHIFT                     (31U)                                               /*!< SIM_SCGC6.DAC0 Position                 */
#define SIM_SCGC6_DAC0(x)                        (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< SIM_SCGC6.DAC0 Field                    */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_DMA_MASK                       (0x100U)                                            /*!< SIM_SCGC7.DMA Mask                      */
#define SIM_SCGC7_DMA_SHIFT                      (8U)                                                /*!< SIM_SCGC7.DMA Position                  */
#define SIM_SCGC7_DMA(x)                         (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_SCGC7.DMA Field                     */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0xF0000U)                                          /*!< SIM_CLKDIV1.OUTDIV4 Mask                */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                (16U)                                               /*!< SIM_CLKDIV1.OUTDIV4 Position            */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< SIM_CLKDIV1.OUTDIV4 Field               */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0xF000000U)                                        /*!< SIM_CLKDIV1.OUTDIV2 Mask                */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                (24U)                                               /*!< SIM_CLKDIV1.OUTDIV2 Position            */
