podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_CLKDIV1.OUTDIV2 Field               */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0xF0000000U)                                       /*!< SIM_CLKDIV1.OUTDIV1 Mask                */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                (28U)                                               /*!< SIM_CLKDIV1.OUTDIV1 Position            */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< SIM_CLKDIV1.OUTDIV1 Field               */
/* ------- FCFG1 Bit Fields                         ------ */
#define SIM_FCFG1_FLASHDIS_MASK                  (0x1U)                                              /*!< SIM_FCFG1.FLASHDIS Mask                 */
#define SIM_FCFG1_FLASHDIS_SHIFT                 (0U)                                                /*!< SIM_FCFG1.FLASHDIS Position             */
#define SIM_FCFG1_FLASHDIS(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_FCFG1.FLASHDIS Field                */
#define SIM_FCFG1_FLASHDOZE_MASK                 (0x2U)                                              /*!< SIM_FCFG1.FLASHDOZE Mask                */
#define SIM_FCFG1_FLASHDOZE_SHIFT                (1U)                                                /*!< SIM_FCFG1.FLASHDOZE Position            */
#define SIM_FCFG1_FLASHDOZE(x)                   (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_FCFG1.FLASHDOZE Field               */
#define SIM_FCFG1_PFSIZE_MASK                    (0xF000000U)                                        /*!< SIM_FCFG1.PFSIZE Mask                   */
#define SIM_FCFG1_PFSIZE_SHIFT                   (24U)                                               /*!< SIM_FCFG1.PFSIZE Position               */
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< SIM_FCFG1.PFSIZE Field                  */
/* ------- FCFG2 Bit Fields                         ------ */
#define SIM_FCFG2_MAXADDR0_MASK                  (0x7F000000U)                                       /*!< SIM_FCFG2.MAXADDR0 Mask                 */
#define SIM_FCFG2_MAXADDR0_SHIFT                 (24U)                                               /*!< SIM_FCFG2.MAXADDR0 Position             */
#define SIM_FCFG2_MAXADDR0(x)                    (((uint32_t)(((uint32_t)(x))<<24U))&0x7F000000UL)   /*!< SIM_FCFG2.MAXADDR0 Field                */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFU)                                       /*!< SIM_UIDH.UID Mask                       */
#define SIM_UIDH_UID_SHIFT                       (0U)                                                /*!< SIM_UIDH.UID Position                   */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDH.UID Field                      */
/* ------- UIDMH Bit Fields                         ------ */
#define SIM_UIDMH_UID_MASK                       (0xFFFFFFFFU)                                       /*!< SIM_UIDMH.UID Mask                      */
#define SIM_UIDMH_UID_SHIFT                      (0U)                                                /*!< SIM_UIDMH.UID Position                  */
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDMH.UID Field                     */
/* ------- UIDML Bit Fields                         ------ */
#define SIM_UIDML_UID_MASK                       (0xFFFFFFFFU)                                       /*!< SIM_UIDML.UID Mask                      */
#define SIM_UIDML_UID_SHIFT                      (0U)                                                /*!< SIM_UIDML.UID Position                  */
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDML.UID Field                     */
/* ------- UIDL Bit Fields                          ------ */
#define SIM_UIDL_UID_MASK                        (0xFFFFFFFFU)                                       /*!< SIM_UIDL.UID Mask                       */
#define SIM_UIDL_UID_SHIFT                       (0U)                                                /*!< SIM_UIDL.UID Position                   */
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< SIM_UIDL.UID Field                      */
/* ------- CLKDIV4 Bit Fields                       ------ */
#define SIM_CLKDIV4_TRACEFRAC_MASK               (0x1U)                                              /*!< SIM_CLKDIV4.TRACEFRAC Mask              */
#define SIM_CLKDIV4_TRACEFRAC_SHIFT              (0U)                                                /*!< SIM_CLKDIV4.TRACEFRAC Position          */
#define SIM_CLKDIV4_TRACEFRAC(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< SIM_CLKDIV4.TRACEFRAC Field             */
#define SIM_CLKDIV4_TRACEDIV_MASK                (0xEU)                                              /*!< SIM_CLKDIV4.TRACEDIV Mask               */
#define SIM_CLKDIV4_TRACEDIV_SHIFT               (1U)                                                /*!< SIM_CLKDIV4.TRACEDIV Position           */
#define SIM_CLKDIV4_TRACEDIV(x)                  (((uint32_t)(((uint32_t)(x))<<1U))&0xEUL)           /*!< SIM_CLKDIV4.TRACEDIV Field              */
#define SIM_CLKDIV4_TRACEDIVEN_MASK              (0x10000000U)                                       /*!< SIM_CLKDIV4.TRACEDIVEN Mask             */
#define SIM_CLKDIV4_TRACEDIVEN_SHIFT             (28U)                                               /*!< SIM_CLKDIV4.TRACEDIVEN Position         */
#define SIM_CLKDIV4_TRACEDIVEN(x)                (((uint32_t)(((uint32_t)(x))<<28U))&0x10000000UL)   /*!< SIM_CLKDIV4.TRACEDIVEN Field            */
/* ------- MISCTRL Bit Fields                       ------ */
#define SIM_MISCTRL_CMPWIN0SRC_MASK              (0x300U)                                            /*!< SIM_MISCTRL.CMPWIN0SRC Mask             */
#define SIM_MISCTRL_CMPWIN0SRC_SHIFT             (8U)                                                /*!< SIM_MISCTRL.CMPWIN0SRC Position         */
#define SIM_MISCTRL_CMPWIN0SRC(x)                (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< SIM_MISCTRL.CMPWIN0SRC Field            */
#define SIM_MISCTRL_CMPWIN1SRC_MASK              (0xC00U)                                            /*!< SIM_MISCTRL.CMPWIN1SRC Mask             */
#define SIM_MISCTRL_CMPWIN1SRC_SHIFT             (10U)                                               /*!< SIM_MISCTRL.CMPWIN1SRC Position         */
#define SIM_MISCTRL_CMPWIN1SRC(x)                (((uint32_t)(((uint32_t)(x))<<10U))&0xC00UL)        /*!< SIM_MISCTRL.CMPWIN1SRC Field            */
#define SIM_MISCTRL_CMPWIN2SRC_MASK              (0x3000U)                                           /*!< SIM_MISCTRL.CMPWIN2SRC Mask             */
#define SIM_MISCTRL_CMPWIN2SRC_SHIFT             (12U)                                               /*!< SIM_MISCTRL.CMPWIN2SRC Position         */
#define SIM_MISCTRL_CMPWIN2SRC(x)                (((uint32_t)(((uint32_t)(x))<<12U))&0x3000UL)       /*!< SIM_MISCTRL.CMPWIN2SRC Field            */
#define SIM_MISCTRL_CMPWIN3SRC_MASK              (0xC000U)                                           /*!< SIM_MISCTRL.CMPWIN3SRC Mask             */
#define SIM_MISCTRL_CMPWIN3SRC_SHIFT             (14U)                                               /*!< SIM_MISCTRL.CMPWIN3SRC Position         */
#define SIM_MISCTRL_CMPWIN3SRC(x)                (((uint32_t)(((uint32_t)(x))<<14U))&0xC000UL)       /*!< SIM_MISCTRL.CMPWIN3SRC Field            */
#define SIM_MISCTRL_EWMINSRC_MASK                (0x10000U)                                          /*!< SIM_MISCTRL.EWMINSRC Mask               */
#define SIM_MISCTRL_EWMINSRC_SHIFT               (16U)                                               /*!< SIM_MISCTRL.EWMINSRC Position           */
#define SIM_MISCTRL_EWMINSRC(x)                  (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SIM_MISCTRL.EWMINSRC Field              */
#define SIM_MISCTRL_DACTRIGSRC_MASK              (0xC0000U)                                          /*!< SIM_MISCTRL.DACTRIGSRC Mask             */
#define SIM_MISCTRL_DACTRIGSRC_SHIFT             (18U)                                               /*!< SIM_MISCTRL.DACTRIGSRC Position         */
#define SIM_MISCTRL_DACTRIGSRC(x)                (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< SIM_MISCTRL.DACTRIGSRC Field            */
/* ------- MISCTRL2 Bit Fields                      ------ */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK      (0x100U)                                            /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG0 Mask     */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT     (8U)                                                /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG0 Position */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0(x)        (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG0 Field    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK      (0x200U)                                            /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG1 Mask     */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT     (9U)                                                /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG1 Position */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1(x)        (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG1 Field    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK      (0x400U)                                            /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG2 Mask     */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT     (10U)                                               /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG2 Position */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2(x)        (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG2 Field    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK      (0x800U)                                            /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG3 Mask     */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT     (11U)                                               /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG3 Position */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3(x)        (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< SIM_MISCTRL2.SYNCXBARAPITTRIG3 Field    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK      (0x1000U)                                           /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG0 Mask     */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT     (12U)                                               /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG0 Position */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0(x)        (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG0 Field    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK      (0x2000U)                                           /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG1 Mask     */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT     (13U)                                               /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG1 Position */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1(x)        (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< SIM_MISCTRL2.SYNCXBARBPITTRIG1 Field    */
#define SIM_MISCTRL2_SYNCDACHWTRIG_MASK          (0x10000U)                                          /*!< SIM_MISCTRL2.SYNCDACHWTRIG Mask         */
#define SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT         (16U)                                               /*!< SIM_MISCTRL2.SYNCDACHWTRIG Position     */
#define SIM_MISCTRL2_SYNCDACHWTRIG(x)            (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SIM_MISCTRL2.SYNCDACHWTRIG Field        */
#define SIM_MISCTRL2_SYNCEWMIN_MASK              (0x20000U)                                          /*!< SIM_MISCTRL2.SYNCEWMIN Mask             */
#define SIM_MISCTRL2_SYNCEWMIN_SHIFT             (17U)                                               /*!< SIM_MISCTRL2.SYNCEWMIN Position         */
#define SIM_MISCTRL2_SYNCEWMIN(x)                (((uint32_t)(((uint32_t)(x))<<17U))&0x20000UL)      /*!< SIM_MISCTRL2.SYNCEWMIN Field            */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK      (0x100000U)                                         /*!< SIM_MISCTRL2.SYNCCMP0SAMPLEWIN Mask     */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT     (20U)                                               /*!< SIM_MISCTRL2.SYNCCMP0SAMPLEWIN Position */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<20U))&0x100000UL)     /*!< SIM_MISCTRL2.SYNCCMP0SAMPLEWIN Field    */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK      (0x200000U)                                         /*!< SIM_MISCTRL2.SYNCCMP1SAMPLEWIN Mask     */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT     (21U)                                               /*!< SIM_MISCTRL2.SYNCCMP1SAMPLEWIN Position */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<21U))&0x200000UL)     /*!< SIM_MISCTRL2.SYNCCMP1SAMPLEWIN Field    */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK      (0x400000U)                                         /*!< SIM_MISCTRL2.SYNCCMP2SAMPLEWIN Mask     */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT     (22U)                                               /*!< SIM_MISCTRL2.SYNCCMP2SAMPLEWIN Position */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< SIM_MISCTRL2.SYNCCMP2SAMPLEWIN Field    */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK      (0x800000U)                                         /*!< SIM_MISCTRL2.SYNCCMP3SAMPLEWIN Mask     */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT     (23U)                                               /*!< SIM_MISCTRL2.SYNCCMP3SAMPLEWIN Position */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< SIM_MISCTRL2.SYNCCMP3SAMPLEWIN Field    */
/* ------- WDOGC Bit Fields                         ------ */
#define SIM_WDOGC_WDOGCLKS_MASK                  (0x2U)                                              /*!< SIM_WDOGC.WDOGCLKS Mask                 */
#define SIM_WDOGC_WDOGCLKS_SHIFT                 (1U)                                                /*!< SIM_WDOGC.WDOGCLKS Position             */
#define SIM_WDOGC_WDOGCLKS(x)                    (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< SIM_WDOGC.WDOGCLKS Field                */
/* ------- PWRC Bit Fields                          ------ */
#define SIM_PWRC_SRPDN_MASK                      (0x3U)                                              /*!< SIM_PWRC.SRPDN Mask                     */
#define SIM_PWRC_SRPDN_SHIFT                     (0U)                                                /*!< SIM_PWRC.SRPDN Position                 */
#define SIM_PWRC_SRPDN(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x3UL)           /*!< SIM_PWRC.SRPDN Field                    */
#define SIM_PWRC_SR27STDBY_MASK                  (0xCU)                                              /*!< SIM_PWRC.SR27STDBY Mask                 */
#define SIM_PWRC_SR27STDBY_SHIFT                 (2U)                                                /*!< SIM_PWRC.SR27STDBY Position             */
#define SIM_PWRC_SR27STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<2U))&0xCUL)           /*!< SIM_PWRC.SR27STDBY Field                */
#define SIM_PWRC_SR12STDBY_MASK                  (0xC0U)                                             /*!< SIM_PWRC.SR12STDBY Mask                 */
#define SIM_PWRC_SR12STDBY_SHIFT                 (6U)                                                /*!< SIM_PWRC.SR12STDBY Position             */
#define SIM_PWRC_SR12STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< SIM_PWRC.SR12STDBY Field                */
#define SIM_PWRC_SRPWRDETEN_MASK                 (0x100U)                                            /*!< SIM_PWRC.SRPWRDETEN Mask                */
#define SIM_PWRC_SRPWRDETEN_SHIFT                (8U)                                                /*!< SIM_PWRC.SRPWRDETEN Position            */
#define SIM_PWRC_SRPWRDETEN(x)                   (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< SIM_PWRC.SRPWRDETEN Field               */
#define SIM_PWRC_SRPWRRDY_MASK                   (0x200U)                                            /*!< SIM_PWRC.SRPWRRDY Mask                  */
#define SIM_PWRC_SRPWRRDY_SHIFT                  (9U)                                                /*!< SIM_PWRC.SRPWRRDY Position              */
#define SIM_PWRC_SRPWRRDY(x)                     (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< SIM_PWRC.SRPWRRDY Field                 */
#define SIM_PWRC_SRPWROK_MASK                    (0x10000U)                                          /*!< SIM_PWRC.SRPWROK Mask                   */
#define SIM_PWRC_SRPWROK_SHIFT                   (16U)                                               /*!< SIM_PWRC.SRPWROK Position               */
#define SIM_PWRC_SRPWROK(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0x10000UL)      /*!< SIM_PWRC.SRPWROK Field                  */
/* ------- ADCOPT Bit Fields                        ------ */
#define SIM_ADCOPT_ADCACH6SEL_MASK               (0x7U)                                              /*!< SIM_ADCOPT.ADCACH6SEL Mask              */
#define SIM_ADCOPT_ADCACH6SEL_SHIFT              (0U)                                                /*!< SIM_ADCOPT.ADCACH6SEL Position          */
#define SIM_ADCOPT_ADCACH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< SIM_ADCOPT.ADCACH6SEL Field             */
#define SIM_ADCOPT_ADCACH7SEL_MASK               (0x70U)                                             /*!< SIM_ADCOPT.ADCACH7SEL Mask              */
#define SIM_ADCOPT_ADCACH7SEL_SHIFT              (4U)                                                /*!< SIM_ADCOPT.ADCACH7SEL Position          */
#define SIM_ADCOPT_ADCACH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<4U))&0x70UL)          /*!< SIM_ADCOPT.ADCACH7SEL Field             */
#define SIM_ADCOPT_ADCBCH6SEL_MASK               (0x700U)                                            /*!< SIM_ADCOPT.ADCBCH6SEL Mask              */
#define SIM_ADCOPT_ADCBCH6SEL_SHIFT              (8U)                                                /*!< SIM_ADCOPT.ADCBCH6SEL Position          */
#define SIM_ADCOPT_ADCBCH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< SIM_ADCOPT.ADCBCH6SEL Field             */
#define SIM_ADCOPT_ADCBCH7SEL_MASK               (0x7000U)                                           /*!< SIM_ADCOPT.ADCBCH7SEL Mask              */
#define SIM_ADCOPT_ADCBCH7SEL_SHIFT              (12U)                                               /*!< SIM_ADCOPT.ADCBCH7SEL Position          */
#define SIM_ADCOPT_ADCBCH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< SIM_ADCOPT.ADCBCH7SEL Field             */
#define SIM_ADCOPT_ROSB_MASK                     (0x1000000U)                                        /*!< SIM_ADCOPT.ROSB Mask                    */
#define SIM_ADCOPT_ROSB_SHIFT                    (24U)                                               /*!< SIM_ADCOPT.ROSB Position                */
#define SIM_ADCOPT_ROSB(x)                       (((uint32_t)(((uint32_t)(x))<<24U))&0x1000000UL)    /*!< SIM_ADCOPT.ROSB Field                   */
#define SIM_ADCOPT_ADCIRCLK_MASK                 (0x2000000U)                                        /*!< SIM_ADCOPT.ADCIRCLK Mask                */
#define SIM_ADCOPT_ADCIRCLK_SHIFT                (25U)                                               /*!< SIM_ADCOPT.ADCIRCLK Position            */
#define SIM_ADCOPT_ADCIRCLK(x)                   (((uint32_t)(((uint32_t)(x))<<25U))&0x2000000UL)    /*!< SIM_ADCOPT.ADCIRCLK Field               */
/**
 * @} */ /* End group SIM_Register_Masks_GROUP 
 */

/* SIM - Peripheral instance base addresses */
#define SIM_BasePtr                    0x40047000UL //!< Peripheral base address
#define SIM                            ((SIM_Type *) SIM_BasePtr) //!< Freescale base pointer
#define SIM_BASE_PTR                   (SIM) //!< Freescale style base pointer
/**
 * @} */ /* End group SIM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SMC_Peripheral_access_layer_GROUP SMC Peripheral Access Layer
* @brief C Struct for SMC
* @{
*/

/* ================================================================================ */
/* ================           SMC (file:SMC_MKV40F15)              ================ */
/* ================================================================================ */

/**
 * @brief System Mode Controller
 */
/**
* @addtogroup SMC_structs_GROUP SMC struct
* @brief Struct for SMC
* @{
*/
typedef struct SMC_Type {
   __IO uint8_t   PMPROT;                       /**< 0000: Power Mode Protection Register                               */
   __IO uint8_t   PMCTRL;                       /**< 0001: Power Mode Control Register                                  */
   __IO uint8_t   STOPCTRL;                     /**< 0002: Stop Control Register                                        */
   __I  uint8_t   PMSTAT;                       /**< 0003: Power Mode Status Register                                   */
} SMC_Type;

/**
 * @} */ /* End group SMC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SMC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

