podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F16.h
#define XBARA_SEL24_SEL49(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL24.SEL49 Field                 */
/* ------- SEL25 Bit Fields                         ------ */
#define XBARA_SEL25_SEL50_MASK                   (0x3FU)                                             /*!< XBARA_SEL25.SEL50 Mask                  */
#define XBARA_SEL25_SEL50_SHIFT                  (0U)                                                /*!< XBARA_SEL25.SEL50 Position              */
#define XBARA_SEL25_SEL50(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL25.SEL50 Field                 */
#define XBARA_SEL25_SEL51_MASK                   (0x3F00U)                                           /*!< XBARA_SEL25.SEL51 Mask                  */
#define XBARA_SEL25_SEL51_SHIFT                  (8U)                                                /*!< XBARA_SEL25.SEL51 Position              */
#define XBARA_SEL25_SEL51(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL25.SEL51 Field                 */
/* ------- SEL26 Bit Fields                         ------ */
#define XBARA_SEL26_SEL52_MASK                   (0x3FU)                                             /*!< XBARA_SEL26.SEL52 Mask                  */
#define XBARA_SEL26_SEL52_SHIFT                  (0U)                                                /*!< XBARA_SEL26.SEL52 Position              */
#define XBARA_SEL26_SEL52(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL26.SEL52 Field                 */
#define XBARA_SEL26_SEL53_MASK                   (0x3F00U)                                           /*!< XBARA_SEL26.SEL53 Mask                  */
#define XBARA_SEL26_SEL53_SHIFT                  (8U)                                                /*!< XBARA_SEL26.SEL53 Position              */
#define XBARA_SEL26_SEL53(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL26.SEL53 Field                 */
/* ------- SEL27 Bit Fields                         ------ */
#define XBARA_SEL27_SEL54_MASK                   (0x3FU)                                             /*!< XBARA_SEL27.SEL54 Mask                  */
#define XBARA_SEL27_SEL54_SHIFT                  (0U)                                                /*!< XBARA_SEL27.SEL54 Position              */
#define XBARA_SEL27_SEL54(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL27.SEL54 Field                 */
#define XBARA_SEL27_SEL55_MASK                   (0x3F00U)                                           /*!< XBARA_SEL27.SEL55 Mask                  */
#define XBARA_SEL27_SEL55_SHIFT                  (8U)                                                /*!< XBARA_SEL27.SEL55 Position              */
#define XBARA_SEL27_SEL55(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL27.SEL55 Field                 */
/* ------- SEL28 Bit Fields                         ------ */
#define XBARA_SEL28_SEL56_MASK                   (0x3FU)                                             /*!< XBARA_SEL28.SEL56 Mask                  */
#define XBARA_SEL28_SEL56_SHIFT                  (0U)                                                /*!< XBARA_SEL28.SEL56 Position              */
#define XBARA_SEL28_SEL56(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL28.SEL56 Field                 */
#define XBARA_SEL28_SEL57_MASK                   (0x3F00U)                                           /*!< XBARA_SEL28.SEL57 Mask                  */
#define XBARA_SEL28_SEL57_SHIFT                  (8U)                                                /*!< XBARA_SEL28.SEL57 Position              */
#define XBARA_SEL28_SEL57(x)                     (((uint16_t)(((uint16_t)(x))<<8U))&0x3F00UL)        /*!< XBARA_SEL28.SEL57 Field                 */
/* ------- SEL29 Bit Fields                         ------ */
#define XBARA_SEL29_SEL58_MASK                   (0x3FU)                                             /*!< XBARA_SEL29.SEL58 Mask                  */
#define XBARA_SEL29_SEL58_SHIFT                  (0U)                                                /*!< XBARA_SEL29.SEL58 Position              */
#define XBARA_SEL29_SEL58(x)                     (((uint16_t)(((uint16_t)(x))<<0U))&0x3FUL)          /*!< XBARA_SEL29.SEL58 Field                 */
/* ------- CTRL0 Bit Fields                         ------ */
#define XBARA_CTRL0_DEN0_MASK                    (0x1U)                                              /*!< XBARA_CTRL0.DEN0 Mask                   */
#define XBARA_CTRL0_DEN0_SHIFT                   (0U)                                                /*!< XBARA_CTRL0.DEN0 Position               */
#define XBARA_CTRL0_DEN0(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< XBARA_CTRL0.DEN0 Field                  */
#define XBARA_CTRL0_IEN0_MASK                    (0x2U)                                              /*!< XBARA_CTRL0.IEN0 Mask                   */
#define XBARA_CTRL0_IEN0_SHIFT                   (1U)                                                /*!< XBARA_CTRL0.IEN0 Position               */
#define XBARA_CTRL0_IEN0(x)                      (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< XBARA_CTRL0.IEN0 Field                  */
#define XBARA_CTRL0_EDGE0_MASK                   (0xCU)                                              /*!< XBARA_CTRL0.EDGE0 Mask                  */
#define XBARA_CTRL0_EDGE0_SHIFT                  (2U)                                                /*!< XBARA_CTRL0.EDGE0 Position              */
#define XBARA_CTRL0_EDGE0(x)                     (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< XBARA_CTRL0.EDGE0 Field                 */
#define XBARA_CTRL0_STS0_MASK                    (0x10U)                                             /*!< XBARA_CTRL0.STS0 Mask                   */
#define XBARA_CTRL0_STS0_SHIFT                   (4U)                                                /*!< XBARA_CTRL0.STS0 Position               */
#define XBARA_CTRL0_STS0(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< XBARA_CTRL0.STS0 Field                  */
#define XBARA_CTRL0_DEN1_MASK                    (0x100U)                                            /*!< XBARA_CTRL0.DEN1 Mask                   */
#define XBARA_CTRL0_DEN1_SHIFT                   (8U)                                                /*!< XBARA_CTRL0.DEN1 Position               */
#define XBARA_CTRL0_DEN1(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< XBARA_CTRL0.DEN1 Field                  */
#define XBARA_CTRL0_IEN1_MASK                    (0x200U)                                            /*!< XBARA_CTRL0.IEN1 Mask                   */
#define XBARA_CTRL0_IEN1_SHIFT                   (9U)                                                /*!< XBARA_CTRL0.IEN1 Position               */
#define XBARA_CTRL0_IEN1(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< XBARA_CTRL0.IEN1 Field                  */
#define XBARA_CTRL0_EDGE1_MASK                   (0xC00U)                                            /*!< XBARA_CTRL0.EDGE1 Mask                  */
#define XBARA_CTRL0_EDGE1_SHIFT                  (10U)                                               /*!< XBARA_CTRL0.EDGE1 Position              */
#define XBARA_CTRL0_EDGE1(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< XBARA_CTRL0.EDGE1 Field                 */
#define XBARA_CTRL0_STS1_MASK                    (0x1000U)                                           /*!< XBARA_CTRL0.STS1 Mask                   */
#define XBARA_CTRL0_STS1_SHIFT                   (12U)                                               /*!< XBARA_CTRL0.STS1 Position               */
#define XBARA_CTRL0_STS1(x)                      (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< XBARA_CTRL0.STS1 Field                  */
/* ------- CTRL1 Bit Fields                         ------ */
#define XBARA_CTRL1_DEN2_MASK                    (0x1U)                                              /*!< XBARA_CTRL1.DEN2 Mask                   */
#define XBARA_CTRL1_DEN2_SHIFT                   (0U)                                                /*!< XBARA_CTRL1.DEN2 Position               */
#define XBARA_CTRL1_DEN2(x)                      (((uint16_t)(((uint16_t)(x))<<0U))&0x1UL)           /*!< XBARA_CTRL1.DEN2 Field                  */
#define XBARA_CTRL1_IEN2_MASK                    (0x2U)                                              /*!< XBARA_CTRL1.IEN2 Mask                   */
#define XBARA_CTRL1_IEN2_SHIFT                   (1U)                                                /*!< XBARA_CTRL1.IEN2 Position               */
#define XBARA_CTRL1_IEN2(x)                      (((uint16_t)(((uint16_t)(x))<<1U))&0x2UL)           /*!< XBARA_CTRL1.IEN2 Field                  */
#define XBARA_CTRL1_EDGE2_MASK                   (0xCU)                                              /*!< XBARA_CTRL1.EDGE2 Mask                  */
#define XBARA_CTRL1_EDGE2_SHIFT                  (2U)                                                /*!< XBARA_CTRL1.EDGE2 Position              */
#define XBARA_CTRL1_EDGE2(x)                     (((uint16_t)(((uint16_t)(x))<<2U))&0xCUL)           /*!< XBARA_CTRL1.EDGE2 Field                 */
#define XBARA_CTRL1_STS2_MASK                    (0x10U)                                             /*!< XBARA_CTRL1.STS2 Mask                   */
#define XBARA_CTRL1_STS2_SHIFT                   (4U)                                                /*!< XBARA_CTRL1.STS2 Position               */
#define XBARA_CTRL1_STS2(x)                      (((uint16_t)(((uint16_t)(x))<<4U))&0x10UL)          /*!< XBARA_CTRL1.STS2 Field                  */
#define XBARA_CTRL1_DEN3_MASK                    (0x100U)                                            /*!< XBARA_CTRL1.DEN3 Mask                   */
#define XBARA_CTRL1_DEN3_SHIFT                   (8U)                                                /*!< XBARA_CTRL1.DEN3 Position               */
#define XBARA_CTRL1_DEN3(x)                      (((uint16_t)(((uint16_t)(x))<<8U))&0x100UL)         /*!< XBARA_CTRL1.DEN3 Field                  */
#define XBARA_CTRL1_IEN3_MASK                    (0x200U)                                            /*!< XBARA_CTRL1.IEN3 Mask                   */
#define XBARA_CTRL1_IEN3_SHIFT                   (9U)                                                /*!< XBARA_CTRL1.IEN3 Position               */
#define XBARA_CTRL1_IEN3(x)                      (((uint16_t)(((uint16_t)(x))<<9U))&0x200UL)         /*!< XBARA_CTRL1.IEN3 Field                  */
#define XBARA_CTRL1_EDGE3_MASK                   (0xC00U)                                            /*!< XBARA_CTRL1.EDGE3 Mask                  */
#define XBARA_CTRL1_EDGE3_SHIFT                  (10U)                                               /*!< XBARA_CTRL1.EDGE3 Position              */
#define XBARA_CTRL1_EDGE3(x)                     (((uint16_t)(((uint16_t)(x))<<10U))&0xC00UL)        /*!< XBARA_CTRL1.EDGE3 Field                 */
#define XBARA_CTRL1_STS3_MASK                    (0x1000U)                                           /*!< XBARA_CTRL1.STS3 Mask                   */
#define XBARA_CTRL1_STS3_SHIFT                   (12U)                                               /*!< XBARA_CTRL1.STS3 Position               */
#define XBARA_CTRL1_STS3(x)                      (((uint16_t)(((uint16_t)(x))<<12U))&0x1000UL)       /*!< XBARA_CTRL1.STS3 Field                  */
/**
 * @} */ /* End group XBARA_Register_Masks_GROUP 
 */

